List data = [
  {
    'index': 'भगवद गीता',
    'chapters': [
      //chapter 1
      {
        'id': 'पहला अध्याय',
        'name': 'अर्जुन विषाद योग',
        'shloks': [
          {
            'no': 1,
            'shlok':
                'धृतराष्ट्र उवाचः\nधर्मक्षेत्रे कुरुक्षेत्रे समवेता युयुत्सवः ।\nमामकाः पाण्डवाश्चैव किमकुर्वत संजय ॥१-१॥',
            'meaning':
                'धृतराष्ट्र बोले -\nहे संजय! धर्मभूमि कुरुक्षेत्र में युद्ध की इच्छा से एकत्र हुए मेरे तथा पाण्डु के पुत्रों ने क्या किया ? ।',
          },
          {
            'no': 2,
            'shlok':
                'संजय उवाचः\nदृष्ट्वा तु पाण्डवानीकं व्यूढं दुर्योधनस्तदा ।\nआचार्यमुपसंगम्य राजा वचनमब्रवीत् ॥१-२॥',
            'meaning':
                'संजय बोले - \nउस समय राजा दुर्योधन ने व्यूहरचनायुक्त पाण्डवों की सेना को देखा और द्रोणाचार्य के पास जाकर यह वचन कहा ।',
          },
          {
            'no': 3,
            'shlok':
                'पश्यैतां पाण्डुपुत्राणामाचार्य महतीं चमूम् । \nव्यूढां द्रुपदपुत्रेण तव शिष्येण धीमता ॥१-३॥',
            'meaning':
                'हे आचार्य! आपके बुद्धिमान्‌ शिष्य द्रुपदपुत्र धृष्टद्युम्न द्वारा व्यूहाकार खड़ी की हुई पाण्डुपुत्रों की इस बड़ी भारी सेना को देखिए ।',
          },
          {
            'no': 4,
            'shlok':
                'अत्र शूरा महेष्वासा भीमार्जुनसमा युधि ।\nयुयुधानो विराटश्च द्रुपदश्च महारथः ॥१-४॥\nधृष्टकेतुश्चेकितानः काशिराजश्च वीर्यवान् ।\nपुरुजित्कुन्तिभोजश्च शैब्यश्च नरपुङ्गवः ॥१-५॥',
            'meaning':
                'इस सेना में भीम तथा अर्जुन के समान युद्ध करने वाले अनेक वीर धनुर्धर हैं – यथा महारथी युयुधान, विराट तथा द्रुपद, इनके साथ ही धृष्टकेतु, चेकितान, काशिराज, पुरुजित्, कुन्तिभोज तथा शैब्य जैसे महान शक्तिशाली योद्धा भी हैं ।',
          },
          {
            'no': 5,
            'shlok':
                'युधामन्युश्च विक्रान्त उत्तमौजाश्च वीर्यवान् ।\nसौभद्रो द्रौपदेयाश्च सर्व एव महारथाः ॥१-६॥\n',
            'meaning':
                'पराक्रमी युधामन्यु, अत्यन्त शक्तिशाली उत्तमौजा, सुभद्रा का पुत्र तथा द्रोपदी के पुत्र – ये सभी महारथी हैं ।',
          },
          {
            'no': 6,
            'shlok':
                'अस्माकं तु विशिष्टा ये तान्निबोध द्विजोत्तम ।\nनायका मम सैन्यस्य संज्ञार्थं तान्ब्रवीमि ते ॥१-७॥\nभवान्भीष्मश्च कर्णश्च कृपश्च समितिंजयः ।\nअश्वत्थामा विकर्णश्च सौमदत्तिस्तथैव च ॥१-८॥\nअन्ये च बहवः शूरा मदर्थे त्यक्तजीविताः ।\nनानाशस्त्रप्रहरणाः सर्वे युद्धविशारदाः ॥१-९॥',
            'meaning':
                'किन्तु हे ब्राह्मणश्रेष्ठ! अपने पक्ष में भी जो प्रधान हैं, उनको आप समझ लीजिए। आपकी जानकारी के लिए मेरी सेना के जो-जो सेनापति हैं, उनको बतलाता हूँ, मेरी सेना में स्वयं आप-द्रोणाचार्य और पितामह भीष्म तथा कर्ण और संग्रामविजयी कृपाचार्य तथा वैसे ही अश्वत्थामा, विकर्ण और सोमदत्त का पुत्र भूरिश्रवा और भी मेरे लिए जीवन की आशा त्याग देने वाले बहुत-से शूरवीर अनेक प्रकार के शस्त्रास्त्रों से सुसज्जित और सब-के-सब युद्ध में चतुर हैं ।',
          },
          {
            'no': 7,
            'shlok':
                'अपर्याप्तं तदस्माकं बलं भीष्माभिरक्षितम् ।\nपर्याप्तं त्विदमेतेषां बलं भीमाभिरक्षितम् ॥१-१०॥',
            'meaning':
                'भीष्म पितामह द्वारा रक्षित हमारी वह सेना सब प्रकार से अजेय है और भीम द्वारा रक्षित इन लोगों की यह सेना जीतने में सुगम है ।',
          },
          {
            'no': 8,
            'shlok':
                'अयनेषु च सर्वेषु यथाभागमवस्थिताः ।\nभीष्ममेवाभिरक्षन्तु भवन्तः सर्व एव हि ॥१-११॥',
            'meaning':
                'इसलिए सब मोर्चों पर अपनी-अपनी जगह स्थित रहते हुए आप लोग सभी निःसंदेह भीष्म पितामह की ही सब ओर से रक्षा करें ।',
          },
          {
            'no': 9,
            'shlok':
                'तस्य संजनयन्हर्षं कुरुवृद्धः पितामहः ।\nसिंहनादं विनद्योच्चैः शङ्खं दध्मौ प्रतापवान् ॥१-१२॥\nततः शङ्खाश्च भेर्यश्च पणवानकगोमुखाः ।\nसहसैवाभ्यहन्यन्त स शब्दस्तुमुलोऽभवत् ॥१-१३॥',
            'meaning':
                'कौरवों में वृद्ध बड़े प्रतापी पितामह भीष्म ने उस दुर्योधन के हृदय में हर्ष उत्पन्न करते हुए उच्च स्वर से सिंह की दहाड़ के समान गरजकर शंख बजाया इसके पश्चात शंख और नगाड़े तथा ढोल, मृदंग और नरसिंघे आदि बाजे एक साथ ही बज उठे। उनका वह शब्द बड़ा भयंकर हुआ ।',
          },
          {
            'no': 10,
            'shlok':
                'ततः श्वेतैर्हयैर्युक्ते महति स्यन्दने स्थितौ ।\nमाधवः पाण्डवश्चैव दिव्यौ शङ्खौ प्रदध्मतुः ॥१-१४॥',
            'meaning':
                'इसके अनन्तर सफेद घोड़ों से युक्त उत्तम रथ में बैठे हुए श्रीकृष्ण महाराज और अर्जुन ने भी अलौकिक शंख बजाए ।',
          },
          {
            'no': 11,
            'shlok':
                'पाञ्चजन्यं हृषीकेशो देवदत्तं धनञ्जयः ।\nपौण्ड्रं दध्मौ महाशङ्खं भीमकर्मा वृकोदरः ॥१-१५॥',
            'meaning':
                'श्रीकृष्ण महाराज ने पाञ्चजन्य नामक, अर्जुन ने देवदत्त नामक और भयानक कर्मवाले भीमसेन ने पौण्ड्र नामक महाशंख बजाया ।',
          },
          {
            'no': 12,
            'shlok':
                'अनन्तविजयं राजा कुन्तीपुत्रो युधिष्ठिरः ।\nनकुलः सहदेवश्च सुघोषमणिपुष्पकौ ॥१-१६॥',
            'meaning':
                'कुन्तीपुत्र राजा युधिष्ठिर ने अनन्तविजय नामक और नकुल तथा सहदेव ने सुघोष और मणिपुष्पक नामक शंख बजाए ।',
          },
          {
            'no': 13,
            'shlok':
                'काश्यश्च परमेष्वासः शिखण्डी च महारथः ।\nधृष्टद्युम्नो विराटश्च सात्यकिश्चापराजितः ॥१-१७॥\nद्रुपदो द्रौपदेयाश्च सर्वशः पृथिवीपते ।\nसौभद्रश्च महाबाहुः शङ्खान्दध्मुः पृथक्पृथक् ॥१-१८॥',
            'meaning':
                'श्रेष्ठ धनुष वाले काशिराज और महारथी शिखण्डी एवं धृष्टद्युम्न तथा राजा विराट और अजेय सात्यकि, राजा द्रुपद एवं द्रौपदी के पाँचों पुत्र और बड़ी भुजावाले सुभद्रा पुत्र अभिमन्यु- इन सभी ने, हे राजन्‌! सब ओर से अलग-अलग शंख बजाए ।',
          },
          {
            'no': 14,
            'shlok':
                'स घोषो धार्तराष्ट्राणां हृदयानि व्यदारयत् ।\nनभश्च पृथिवीं चैव तुमुलो व्यनुनादयन् ॥१-१९॥',
            'meaning':
                'और उस भयानक शब्द ने आकाश और पृथ्वी को भी गुंजाते हुए धार्तराष्ट्रों के अर्थात आपके पक्षवालों के हृदय विदीर्ण कर दिए ।',
          },
          {
            'no': 15,
            'shlok':
                'अथ व्यवस्थितान्दृष्ट्वा धार्तराष्ट्रान्कपिध्वजः ।\nप्रवृत्ते शस्त्रसंपाते धनुरुद्यम्य पाण्डवः ॥१-२०॥',
            'meaning':
                'उस समय हनुमान से अंकित ध्वजा लगे रथ पर आसीन पाण्डुपुत्र अर्जुन अपना धनुष उठा कर तीर चलाने के लिए उद्यत हुआ | हे राजन्!धृतराष्ट्र के पुत्रों को व्यूह में खड़ा देखकर अर्जुन ने श्रीकृष्ण से ये वचन कहे ।',
          },
          {
            'no': 16,
            'shlok':
                'अर्जुन उवाचः\nहृषीकेशं तदा वाक्यमिदमाह महीपते ।\nसेनयोरुभयोर्मध्ये रथं स्थापय मेऽच्युत ॥१-२१॥\nयावदेतान्निरिक्षेऽहं योद्‌धुकामानवस्थितान् ।\nकैर्मया सह योद्धव्यमस्मिन् रणसमुद्यमे ॥१-२२॥\nयोत्स्यमानानवेक्षेऽहं य एतेऽत्र समागताः ।\nधार्तराष्ट्रस्य दुर्बुद्धेर्युद्धे प्रियचिकीर्षवः ॥१-२३॥',
            'meaning':
                'अर्जुन ने कहा – हे अच्युत! कृपा करके मेरा रथ दोनों सेनाओं के बीच में ले चलें जिससे मैं यहाँ युद्ध की अभिलाषा रखने वालों को और शस्त्रों कि इस महान परीक्षा में, जिनसे मुझे संघर्ष करना है, उन्हें देख सकूँ, मुझे उन लोगों को देखने दीजिये जो यहाँ पर धृतराष्ट्र के दुर्बुद्धि पुत्र (दुर्योधन) को प्रसन्न करने की इच्छा से लड़ने के लिए आये हुए हैं ।',
          },
          {
            'no': 17,
            'shlok':
                'संजय उवाचः\nएवमुक्तो हृषीकेशो गुडाकेशेन भारत ।\nसेनयोरुभयोर्मध्ये स्थापयित्वा रथोत्तमम् ॥१-२४॥\nभीष्मद्रोणप्रमुखतः सर्वेषां च महीक्षिताम् ।\nउवाच पार्थ पश्यैतान्समवेतान्कुरूनिति ॥१-२५॥',
            'meaning':
                'संजय बोले- हे धृतराष्ट्र! अर्जुन द्वारा कहे अनुसार महाराज श्रीकृष्णचंद्र ने दोनों सेनाओं के बीच में भीष्म और द्रोणाचार्य के सामने तथा सम्पूर्ण राजाओं के सामने उत्तम रथ को खड़ा कर इस प्रकार कहा कि हे पार्थ! युद्ध के लिए जुटे हुए इन कौरवों को देख ।',
          },
          {
            'no': 18,
            'shlok':
                'तत्रापश्यत्स्थितान्पार्थः पितॄनथ पितामहान् ।\nआचार्यान्मातुलान्भ्रातॄन्पुत्रान्पौत्रान्सखींस्तथा ॥१-२६॥',
            'meaning':
                'अर्जुन ने वहाँ पर दोनों पक्षों की सेनाओं के मध्य में अपने चाचा-ताउओं, पितामहों, गुरुओं, मामाओं, भाइयों, पुत्रों, पौत्रों, मित्रों, ससुरों और शुभचिन्तकों को भी देखा ।',
          },
          {
            'no': 19,
            'shlok':
                'कृपया परयाविष्टो विषीदन्निदमब्रवीत् ।\nदृष्ट्वेमं स्वजनं कृष्ण युयुत्सुं समुपस्थितम् ॥१-२७॥',
            'meaning':
                'उन उपस्थित सम्पूर्ण बंधुओं को देखकर वे कुंतीपुत्र अर्जुन अत्यन्त करुणा से युक्त होकर शोक करते हुए यह वचन बोले ।',
          },
          {
            'no': 20,
            'shlok':
                'श्वशुरान्सुहृदश्चैव सेनयोरुभयोरपि ।\nतान्समीक्ष्य स कौन्तेयः सर्वान्बन्धूनवस्थितान् ॥१-२८॥\nसीदन्ति मम गात्राणि मुखं च परिशुष्यति ।\nवेपथुश्च शरीरे मे रोमहर्षश्च जायते ॥१-२९॥\nगाण्डीवं स्रंसते हस्तात्त्वक्चैव परिदह्यते ।\nन च शक्नोम्यवस्थातुं भ्रमतीव च मे मनः ॥१-३०॥',
            'meaning':
                'अर्जुन ने कहा – हे कृष्ण! इस प्रकार युद्ध कि इच्छा रखने वाले मित्रों तथा सम्बन्धियों को अपने समक्ष उपस्थित देखकर मेरे शरीर के अंग काँप रहे हैं और मेरा मुँह सूखा जा रहा है, मेरा सारा शरीर काँप रहा है, मेरे रोंगटे खड़े हो रहे हैं, मेरा गाण्डीव धनुष मेरे हाथ से सरक रहा है और मेरी त्वचा जल रही है, मैं यहाँ अब और अधिक खड़ा रहने में असमर्थ हूँ । मैं अपने को भूल रहा हूँ और मेरा सिर चकरा रहा है । हे कृष्ण! मुझे तो केवल अमंगल के कारण दिख रहे हैं ।',
          },
          {
            'no': 21,
            'shlok':
                'निमित्तानि च पश्यामि विपरीतानि केशव ।\nन च श्रेयोऽनुपश्यामि हत्वा स्वजनमाहवे ॥१-३१॥\nन काङ्क्षे विजयं कृष्ण न च राज्यं सुखानि च ।\nकिं नो राज्येन गोविन्द किं भोगैर्जीवितेन वा ॥१-३२॥',
            'meaning':
                'हे केशव! मैं लक्षणों को भी विपरीत ही देख रहा हूँ तथा युद्ध में स्वजन-समुदाय को मारकर कल्याण भी नहीं देखता, हे कृष्ण! मैं न तो विजय चाहता हूँ और न राज्य तथा सुखों को ही। हे गोविंद! हमें ऐसे राज्य से क्या प्रयोजन है अथवा ऐसे भोगों से और जीवन से भी क्या लाभ है?',
          },
          {
            'no': 22,
            'shlok':
                'येषामर्थे काङ्क्षितं नो राज्यं भोगाः सुखानि च ।\nत इमेऽवस्थिता युद्धे प्राणांस्त्यक्त्वा धनानि च ॥१-३३॥\nआचार्याः पितरः पुत्रास्तथैव च पितामहाः ।\nमातुलाः श्वशुराः पौत्राः श्यालाः संबन्धिनस्तथा ॥१-३४॥',
            'meaning':
                'हमें जिनके लिए राज्य, भोग और सुखादि अभीष्ट हैं, वे ही ये सब धन और जीवन की आशा को त्यागकर युद्ध में खड़े हैं, गुरुजन, ताऊ-चाचे, लड़के और उसी प्रकार दादे, मामे, ससुर, पौत्र, साले तथा और भी संबंधी लोग हैं ।',
          },
          {
            'no': 23,
            'shlok':
                'एतान्न हन्तुमिच्छामि घ्नतोऽपि मधुसूदन ।\nअपि त्रैलोक्यराज्यस्य हेतोः किं नु महीकृते ॥१-३५॥',
            'meaning':
                'हे मधुसूदन! मुझे मारने पर भी अथवा तीनों लोकों के राज्य के लिए भी मैं इन सबको मारना नहीं चाहता, फिर पृथ्वी के लिए तो कहना ही क्या है?',
          },
          {
            'no': 24,
            'shlok':
                'निहत्य धार्तराष्ट्रान्नः का प्रीतिः स्याज्जनार्दन ।\nपापमेवाश्रयेदस्मान्हत्वैतानाततायिनः ॥१-३६॥\nतस्मान्नार्हा वयं हन्तुं धार्तराष्ट्रान्स्वबान्धवान् ।\nस्वजनं हि कथं हत्वा सुखिनः स्याम माधव ॥१-३७॥',
            'meaning':
                'हे जनार्दन! धृतराष्ट्र के पुत्रों को मारकर हमें क्या प्रसन्नता होगी? इन आततायियों को मारकर तो हमें पाप ही लगेगा, अतएव हे माधव! अपने ही बान्धव धृतराष्ट्र के पुत्रों को मारने के लिए हम योग्य नहीं हैं क्योंकि अपने ही कुटुम्ब को मारकर हम कैसे सुखी होंगे?',
          },
          {
            'no': 25,
            'shlok':
                'यद्यप्येते न पश्यन्ति लोभोपहतचेतसः ।\nकुलक्षयकृतं दोषं मित्रद्रोहे च पातकम् ॥१-३८॥',
            'meaning':
                'यद्यपि लोभ से भ्रष्टचित्त हुये ये लोग कुलनाशकृत दोष और मित्र द्रोह में पाप नहीं देखते हैं ।',
          },
          {
            'no': 26,
            'shlok':
                'कथं न ज्ञेयमस्माभिः पापादस्मान्निवर्तितुम् ।\nकुलक्षयकृतं दोषं प्रपश्यद्भिर्जनार्दन ॥१-३९॥\nकुलक्षये प्रणश्यन्ति कुलधर्माः सनातनाः ।\nधर्मे नष्टे कुलं कृत्स्नमधर्मोऽभिभवत्युत ॥१-४०॥',
            'meaning':
                'हेे जनार्दन ! कुलक्षय से होने वाले दोष को जानने वाले हम लोगों को इस पाप से विरत होने के लिए क्यों नहीं सोचना चाहिये, कुल के नष्ट होने से सनातन धर्म नष्ट हो जाते हैं। धर्म नष्ट होने पर सम्पूर्ण कुल को अधर्म (पाप) दबा लेता है ।',
          },
          {
            'no': 27,
            'shlok':
                'अधर्माभिभवात्कृष्ण प्रदुष्यन्ति कुलस्त्रियः ।\nस्त्रीषु दुष्टासु वार्ष्णेय जायते वर्णसंकरः ॥१-४१॥',
            'meaning':
                'हे कृष्ण ! पाप के अधिक बढ़ जाने से कुल की स्त्रियां दूषित हो जाती हैं, और हे वार्ष्णेय ! स्त्रियों के दूषित होने पर वर्णसंकर उत्पन्न होता है ।',
          },
          {
            'no': 28,
            'shlok':
                'संकरो नरकायैव कुलघ्नानां कुलस्य च ।\nपतन्ति पितरो ह्येषां लुप्तपिण्डोदकक्रियाः ॥१-४२॥\nदोषैरेतैः कुलघ्नानां वर्णसंकरकारकैः ।\nउत्साद्यन्ते जातिधर्माः कुलधर्माश्च शाश्वताः ॥१-४३॥\nउत्सन्नकुलधर्माणां मनुष्याणां जनार्दन ।\nनरकेऽनियतं वासो भवतीत्यनुशुश्रुम ॥१-४४॥\nअहो बत महत्पापं कर्तुं व्यवसिता वयम् ।\nयद्राज्यसुखलोभेन हन्तुं स्वजनमुद्यताः ॥१-४५॥',
            'meaning':
                'वर्णसंकर कुलघातियों को और कुल को नरक में ले जाने के लिए ही होता है। लुप्त हुई पिण्ड और जल की क्रिया वाले अर्थात श्राद्ध और तर्पण से वंचित इनके पितर लोग भी अधोगति को प्राप्त होते हैं, इन वर्णसंकरकारक दोषों से कुलघातियों के सनातन कुल-धर्म और जाति-धर्म नष्ट हो जाते हैं, हे जनार्दन! जिनका कुल-धर्म नष्ट हो गया है, ऐसे मनुष्यों का अनिश्चितकाल तक नरक में वास होता है, ऐसा हम सुनते आए हैं, हा! शोक! हम लोग बुद्धिमान होकर भी महान पाप करने को तैयार हो गए हैं, जो राज्य और सुख के लोभ से स्वजनों को मारने के लिए उद्यत हो गए हैं ।',
          },
          {
            'no': 29,
            'shlok':
                'यदि मामप्रतीकारमशस्त्रं शस्त्रपाणयः ।\nधार्तराष्ट्रा रणे हन्युस्तन्मे क्षेमतरं भवेत् ॥१-४६॥',
            'meaning':
                'यदि मुझ शस्त्ररहित एवं सामना न करने वाले को शस्त्र हाथ में लिए हुए धृतराष्ट्र के पुत्र रण में मार डालें तो वह मारना भी मेरे लिए अधिक कल्याणकारक होगा ।',
          },
          {
            'no': 30,
            'shlok':
                'संजय उवाचः\nएवमुक्त्वार्जुनः संख्ये रथोपस्थ उपाविशत् । \nविसृज्य सशरं चापं शोकसंविग्नमानसः ॥१-४७॥',
            'meaning':
                'संजय बोले- रणभूमि में शोक से उद्विग्न मन वाले अर्जुन इस प्रकार कहकर, बाणसहित धनुष को त्यागकर रथ के पिछले भाग में बैठ गए ।',
          },
        ],
      },
      //chapter 2
      {
        'id': 'दूसरा अध्याय',
        'name': 'सांख्ययोग',
        'shloks': [
          {
            'shlok': '',
            'meaning': '',
          },
        ],
      },
      //chapter 3
      {
        'id': 'तीसरा अध्याय',
        'name': 'कर्मयोग',
        'shloks': [
          {
            'shlok': '',
            'meaning': '',
          },
        ],
      },
      //chapter 4
      {
        'id': 'चौथा अध्याय',
        'name': 'ज्ञानकर्मसन्यासयोग',
        'shloks': [
          {
            'shlok': '',
            'meaning': '',
          },
        ],
      },
      //chapter 5
      {
        'id': 'पाँचवाँ अध्याय',
        'name': 'कर्मसंन्यासयोग',
        'shloks': [
          {
            'shlok': '',
            'meaning': '',
          },
        ],
      },
      //chapter 6
      {
        'id': 'छठा अध्याय',
        'name': 'आत्मसंयमयोग',
        'shloks': [
          {
            'shlok': '',
            'meaning': '',
          },
        ],
      },
      //chapter 7
      {
        'id': 'सातवाँ अध्याय',
        'name': 'ज्ञानविज्ञानयोग',
        'shloks': [
          {
            'shlok': '',
            'meaning': '',
          },
        ],
      },
      //chapter 8
      {
        'id': 'आठवाँ अध्याय',
        'name': 'अक्षरब्रह्मयोग',
        'shloks': [
          {
            'no': 1,
            'shlok':
                'किं तद्ब्रह्म किमध्यात्मं किं कर्म पुरुषोत्तम ।\nअधिभूतं च किं प्रोक्तमधिदैवं किमुच्यते ॥८-१॥',
            'meaning':
                'अर्जुन ने कहा – हे भगवान्! हे पुरुषोत्तम! ब्रह्म क्या है? आत्मा क्या है? सकाम कर्म क्या है? यह भौतिक जगत क्या है? तथा देवता क्या हैं? कृपा करके यह सब मुझे बताइये ।',
          },
          {
            'no': 2,
            'shlok':
                'अधियज्ञः कथं कोऽत्र देहेऽस्मिन्मधुसूदन ।\nप्रयाणकाले च कथं ज्ञेयोऽसि नियतात्मभिः ॥८-२॥',
            'meaning':
                'हे मधुसूदन! यज्ञ का स्वामी कौन है और वह शरीर में कैसे रहता है? और मृत्यु के समय भक्ति में लगे रहने वाले आपको कैसे जान पाते हैं?',
          },
          {
            'no': 3,
            'shlok':
                'अक्षरं ब्रह्म परमं स्वभावोऽध्यात्ममुच्यते ।\nभूतभावोद्भवकरो विसर्गः कर्मसंज्ञितः ॥८-३॥',
            'meaning':
                'भगवान् ने कहा – अविनाशी और दिव्य जीव ब्रह्म कहलाता है और उसका नित्य स्वभाव अध्यात्म या आत्म कहलाता है । जीवों के भौतिक शरीर से सम्बन्धित गतिविधि कर्म या सकाम कर्म कहलाती है ।',
          },
          {
            'no': 4,
            'shlok':
                'अधिभूतं क्षरो भावः पुरुषश्चाधिदैवतम् ।\nअधियज्ञोऽहमेवात्र देहे देहभृतां वर ॥८-४॥',
            'meaning':
                'हे देहधारियों में श्रेष्ठ! निरन्तर परिवर्तनशील यह भौतिक प्रकृति अधिभूत (भौतिक अभिव्यक्ति) कहलाती है । भगवान् का विराट रूप, जिसमें सूर्य तथा चन्द्र जैसे समस्त देवता सम्मिलित हैं, अधिदैव कहलाता है । तथा प्रत्येक देहधारी के हृदय में परमात्मा स्वरूप स्थित मैं परमेश्र्वर (यज्ञ का स्वामी) कहलाता हूँ ।',
          },
          {
            'no': 5,
            'shlok':
                'अन्तकाले च मामेव स्मरन्मुक्त्वा कलेवरम् ।\nयः प्रयाति स मद्भावं याति नास्त्यत्र संशयः ॥८-५॥',
            'meaning':
                'और जीवन के अन्त में जो केवल मेरा स्मरण करते हुए शरीर का त्याग करता है, वह तुरन्त मेरे स्वभाव को प्राप्त करता है । इसमें रंचमात्र भी सन्देह नहीं है ।',
          },
          {
            'no': 6,
            'shlok':
                'यं यं वापि स्मरन्भावं त्यजत्यन्ते कलेवरम् ।\nतं तमेवैति कौन्तेय सदा तद्भावभावितः ॥८-६॥',
            'meaning':
                'हे कुन्तीपुत्र! शरीर त्यागते समय मनुष्य जिस-जिस भाव का स्मरण करता है, वह उस उस भाव को निश्चित रूप से प्राप्त होता है ।',
          },
          {
            'no': 7,
            'shlok':
                'तस्मात्सर्वेषु कालेषु मामनुस्मर युध्य च ।\nमय्यर्पितमनोबुद्धिर्मामेवैष्यस्यसंशयम् ॥८-७॥',
            'meaning':
                'अतएव, हे अर्जुन! तुम्हें सदैव कृष्ण रूप में मेरा चिन्तन करना चाहिए और साथ ही युद्ध करने के कर्तव्य को भी पूरा करना चाहिए । अपने कर्मों को मुझे समर्पित करके तथा अपने मन एवं बुद्धि को मुझमें स्थिर करके तुम निश्चित रूप से मुझे प्राप्त कर सकोगे ।',
          },
          {
            'no': 8,
            'shlok':
                'अभ्यासयोगयुक्तेन चेतसा नान्यगामिना ।\nपरमं पुरुषं दिव्यं याति पार्थानुचिन्तयन् ॥८-८॥',
            'meaning':
                'हे पार्थ! जो व्यक्ति मेरा स्मरण करने में अपना मन निरन्तर लगाये रखकर अविचलित भाव से भगवान् के रूप में मेरा ध्यान करता है, वह मुझको अवश्य ही प्राप्त होता है ।',
          },
          {
            'no': 9,
            'shlok':
                'कविं पुराणमनुशासितारमणोरणीयांसमनुस्मरेद्यः ।\nसर्वस्य धातारमचिन्त्यरूप मादित्यवर्णं तमसः परस्तात् ॥८-९॥',
            'meaning':
                'मनुष्य को चाहिए कि परमपुरुष का ध्यान सर्वज्ञ, पुरातन, नियन्ता, लघुतम से भी लघुतर, प्रत्येक के पालनकर्ता, समस्त भौतिकबुद्धि से परे, अचिन्त्य तथा नित्य पुरुष के रूप में करे । वे सूर्य की भाँति तेजवान हैं और इस भौतिक प्रकृति से परे, दिव्य रूप हैं ।',
          },
          {
            'no': 10,
            'shlok':
                'प्रयाणकाले मनसाचलेन भक्त्या युक्तो योगबलेन चैव ।\nभ्रुवोर्मध्ये प्राणमावेश्य सम्यक् स तं परं पुरुषमुपैति दिव्यम् ॥',
            'meaning':
                'मृत्यु के समय जो व्यक्ति अपने प्राण को भौहों के मध्य स्थिर कर लेता है और योगशक्ति के द्वारा अविचलित मन से पूर्णभक्ति के साथ परमेश्र्वर के स्मरण में अपने को लगाता है, वह निश्चित रूप से भगवान् को प्राप्त होता है ।',
          },
          {
            'no': 11,
            'shlok':
                'यदक्षरं वेदविदो वदन्ति विशन्ति यद्यतयो वीतरागाः ।\nयदिच्छन्तो ब्रह्मचर्यं चरन्ति तत्ते पदं संग्रहेण प्रवक्ष्ये ॥८-११॥',
            'meaning':
                'जो वेदों के ज्ञाता हैं, जो ओंकार का उच्चारण करते हैं और जो संन्यास आश्रम के बड़े-बड़े मुनि हैं, वे ब्रह्म में प्रवेश करते हैं । ऐसी सिद्धि की इच्छा करने वाले ब्रह्मचर्यव्रत का अभ्यास करते हैं । अब मैं तुम्हें वह विधि बताऊँगा, जिससे कोई भी व्यक्ति मुक्ति-लाभ कर सकता है ।',
          },
          {
            'no': 12,
            'shlok':
                'सर्वद्वाराणि संयम्य मनो हृदि निरुध्य च ।\nमूर्ध्न्याधायात्मनः प्राणमास्थितो योगधारणाम् ॥८-१२॥',
            'meaning':
                'समस्त ऐन्द्रिय क्रियाओं से विरक्ति को योग की स्थिति (योगधारणा) कहा जाता है । इन्द्रियों के समस्त द्वारों को बन्द करके तथा मन को हृदय में और प्राणवायु को सिर पर केन्द्रित करके मनुष्य अपने को योग में स्थापित करता है ।',
          },
          {
            'no': 13,
            'shlok':
                'ओमित्येकाक्षरं ब्रह्म व्याहरन्मामनुस्मरन् ।\nयः प्रयाति त्यजन्देहं स याति परमां गतिम् ॥८-१३॥',
            'meaning':
                'इस योगाभ्यास में स्थित होकर तथा अक्षरों के परं संयोग यानी ओंकार का उच्चारण करते हुए यदि कोई भगवान् का चिन्तन करता है और अपने शरीर का त्याग करता है, तो वह निश्चित रूप से आध्यात्मिक लोकों को जाता है ।',
          },
          {
            'no': 14,
            'shlok':
                'अनन्यचेताः सततं यो मां स्मरति नित्यशः ।\nतस्याहं सुलभः पार्थ नित्ययुक्तस्य योगिनः ॥८-१४॥',
            'meaning':
                'हे अर्जुन! जो अनन्य भाव से निरन्तर मेरा स्मरण करता है उसके लिए मैं सुलभ हूँ, क्योंकि वह मेरी भक्ति में प्रवृत्त रहता है ।',
          },
          {
            'no': 15,
            'shlok':
                'मामुपेत्य पुनर्जन्म दुःखालयमशाश्वतम् ।\nनाप्नुवन्ति महात्मानः संसिद्धिं परमां गताः ॥८-१५॥',
            'meaning':
                'मुझे प्राप्त करके महापुरुष, जो भक्तियोगी हैं, कभी भी दुखों से पूर्ण इस अनित्य जगत् में नहीं लौटते, क्योंकि उन्हें परम सिद्धि प्राप्त हो चुकी होती है ।',
          },
          {
            'no': 16,
            'shlok':
                'आब्रह्मभुवनाल्लोकाः पुनरावर्तिनोऽर्जुन ।\nमामुपेत्य तु कौन्तेय पुनर्जन्म न विद्यते ॥८-१६॥',
            'meaning':
                'इस जगत् में सर्वोच्च लोक से लेकर निम्नतम सारे लोक दुखों के घर हैं, जहाँ जन्म तथा मरण का चक्कर लगा रहता है । किन्तु हे कुन्तीपुत्र! जो मेरे धाम को प्राप्त कर लेता है, वह फिर कभी जन्म नहीं लेता ।',
          },
          {
            'no': 17,
            'shlok':
                'सहस्रयुगपर्यन्तमहर्यद्ब्रह्मणो विदुः ।\nरात्रिं युगसहस्रान्तां तेऽहोरात्रविदो जनाः ॥८-१७॥',
            'meaning':
                'मानवीय गणना के अनुसार एक हजार युग मिलकर ब्रह्मा का दिन बनता है और इतनी ही बड़ी ब्रह्मा की रात्रि भी होती है ।',
          },
          {
            'no': 18,
            'shlok':
                'अव्यक्ताद्व्यक्तयः सर्वाः प्रभवन्त्यहरागमे ।\nरात्र्यागमे प्रलीयन्ते तत्रैवाव्यक्तसंज्ञके ॥८-१८॥',
            'meaning':
                'ब्रह्मा के दिन के शुभारम्भ में सारे जीव अव्यक्त अवस्था से व्यक्त होते हैं और फिर जब रात्रि आती है तो वे पुनः अव्यक्त में विलीन हो जाते हैं ।',
          },
          {
            'no': 19,
            'shlok':
                'भूतग्रामः स एवायं भूत्वा भूत्वा प्रलीयते ।\nरात्र्यागमेऽवशः पार्थ प्रभवत्यहरागमे ॥८-१९॥',
            'meaning':
                'जब-जब ब्रह्मा का दिन आता है तो सारे जीव प्रकट होते हैं और ब्रह्मा की रात्रि होते ही वे असहायवत् विलीन हो जाते हैं ।',
          },
          {
            'no': 20,
            'shlok':
                'परस्तस्मात्तु भावोऽन्योऽव्यक्तोऽव्यक्तात्सनातनः ।\nयः स सर्वेषु भूतेषु नश्यत्सु न विनश्यति ॥८-२०॥',
            'meaning':
                'इसके अतिरिक्त एक अन्य अव्यय प्रकृति है, जो शाश्र्वत है और इस व्यक्त तथा अव्यक्त पदार्थ से परे है । यह परा (श्रेष्ठ) और कभी न नाश होने वाली है । जब इस संसार का सब कुछ लय हो जाता है, तब भी उसका नाश नहीं होता ।',
          },
          {
            'no': 21,
            'shlok':
                'अव्यक्तोऽक्षर इत्युक्तस्तमाहुः परमां गतिम् ।\nयं प्राप्य न निवर्तन्ते तद्धाम परमं मम ॥८-२१॥',
            'meaning':
                'जिसे वेदान्ती अप्रकट और अविनाशी बताते हैं, जो परम गन्तव्य है, जिसे प्राप्त कर लेने पर कोई वापस नहीं आता, वही मेरा परमधाम है ।',
          },
          {
            'no': 22,
            'shlok':
                'पुरुषः स परः पार्थ भक्त्या लभ्यस्त्वनन्यया ।\nयस्यान्तःस्थानि भूतानि येन सर्वमिदं ततम् ॥८-२२॥',
            'meaning':
                'भगवान्, जो सबसे महान हैं, अनन्य भक्ति द्वारा ही प्राप्त किये जा सकते हैं । यद्यपि वे अपने धाम में विराजमान हैं, तो भी वे सर्वव्यापी हैं और उनमें सब कुछ स्थित है ।',
          },
          {
            'no': 23,
            'shlok':
                'यत्र काले त्वनावृत्तिमावृत्तिं चैव योगिनः ।\nप्रयाता यान्ति तं कालं वक्ष्यामि भरतर्षभ ॥८-२३॥',
            'meaning':
                'हे भरतश्रेष्ठ! अब मैं उन विभिन्न कालों को बताऊँगा, जिनमें इस संसार से प्रयाण करने के बाद योगी पुनः आता है अथवा नहीं आता ।',
          },
          {
            'no': 24,
            'shlok':
                'अग्निर्ज्योतिरहः शुक्लः षण्मासा उत्तरायणम् ।\nतत्र प्रयाता गच्छन्ति ब्रह्म ब्रह्मविदो जनाः ॥८-२४॥',
            'meaning':
                'जो परब्रह्म के ज्ञाता हैं, वे अग्निदेव के प्रभाव में, प्रकाश में, दिन के शुभक्षण में, शुक्लपक्ष में या जब सूर्य उत्तरायण में रहता है, उन छह मासों में इस संसार से शरीर त्याग करने पर उस परब्रह्म को प्राप्त करते हैं ।',
          },
          {
            'no': 25,
            'shlok':
                'धूमो रात्रिस्तथा कृष्णः षण्मासा दक्षिणायनम् ।\nतत्र चान्द्रमसं ज्योतिर्योगी प्राप्य निवर्तते ॥८-२५॥',
            'meaning':
                'जो योगी धुएँ, रात्री, कृष्णपक्ष में या सूर्य के दक्षिणायन रहने के छह महीनों में दिवंगत होता है, वह चन्द्रलोक को जाता है, किन्तु वहाँ से पुनः (पृथ्वी पर) चला आता है ।',
          },
          {
            'no': 26,
            'shlok':
                'शुक्लकृष्णे गती ह्येते जगतः शाश्वते मते ।\nएकया यात्यनावृत्तिमन्ययावर्तते पुनः ॥८-२६॥',
            'meaning':
                'वैदिक मतानुसार इस संसार से प्रयाण करने के दो मार्ग हैं – एक प्रकाश का तथा दूसरा अंधकार का । जब मनुष्य प्रकाश के मार्ग से जाता है तो वह वापस नहीं आता, किन्तु अंधकार के मार्ग से जाने वाला पुनः लौटकर आता है ।',
          },
          {
            'no': 27,
            'shlok':
                'नैते सृती पार्थ जानन्योगी मुह्यति कश्चन ।\nतस्मात्सर्वेषु कालेषु योगयुक्तो भवार्जुन ॥८-२७॥',
            'meaning':
                'हे अर्जुन! यद्यपि भक्तगण इन दोनों मार्गों को जानते हैं, किन्तु वे मोहग्रस्त नहीं होते । अतः तुम भक्ति में सदैव स्थिर रहो ।',
          },
          {
            'no': 28,
            'shlok':
                'वेदेषु यज्ञेषु तपःसु चैव दानेषु यत् पुण्यफलं प्रदिष्टम् ।\nअत्येति तत्सर्वमिदं विदित्वा योगी परं स्थानमुपैति चाद्यम् ॥',
            'meaning':
                'जो व्यक्ति भक्तिमार्ग स्वीकार करता है, वह वेदाध्ययन, तपस्या, दान, दार्शनिक तथा सकाम कर्म करने से प्राप्त होने वाले फलों से वंचित नहीं होता । वह मात्र भक्ति सम्पन्न करके इन समस्त फलों की प्राप्ति करता है और अन्त में परम नित्यधाम को प्राप्त होता है ।',
          },
        ],
      },
      //chapter 9
      {
        'id': 'नौवाँ अध्याय',
        'name': 'राजविद्याराजगुह्ययोग',
        'shloks': [
          {
            'no': 1,
            'shlok':
                'इदं तु ते गुह्यतमं प्रवक्ष्याम्यनसूयवे ।\nज्ञानं विज्ञानसहितं यज्ज्ञात्वा मोक्ष्यसेऽशुभात् ॥९-१॥',
            'meaning':
                'श्रीभगवान् ने कहा – हे अर्जुन! चूँकि तुम मुझसे कभी ईर्ष्या नहीं करते, इसीलिए मैं तुम्हें यह परम गुह्यज्ञान तथा अनुभूति बतलाऊँगा, जिसे जानकर तुम संसार के सारे क्लेशों से मुक्त हो जाओगे ।',
          },
          {
            'no': 2,
            'shlok':
                'राजविद्या राजगुह्यं पवित्रमिदमुत्तमम् ।\nप्रत्यक्षावगमं धर्म्यं सुसुखं कर्तुमव्ययम् ॥९-२॥',
            'meaning':
                'यह ज्ञान सब विद्याओं का राजा है, जो समस्त रहस्यों में सर्वाधिक गोपनीय है । यह परम शुद्ध है और चूँकि यह आत्मा की प्रत्यक्ष अनुभूति कराने वाला है, अतः यह धर्म का सिद्धान्त है | यह अविनाशी है और अत्यन्त सुखपूर्वक सम्पन्न किया जाता है ।',
          },
          {
            'no': 3,
            'shlok':
                'अश्रद्दधानाः पुरुषा धर्मस्यास्य परन्तप ।\nअप्राप्य मां निवर्तन्ते मृत्युसंसारवर्त्मनि ॥९-३॥',
            'meaning':
                'हे परन्तप! जो लोग भक्ति में श्रद्धा नहीं रखते, वे मुझे प्राप्त नहीं कर पाते । अतः वे इस भौतिक जगत् में जन्म-मृत्यु के मार्ग पर वापस आते रहते हैं ।',
          },
          {
            'no': 4,
            'shlok':
                'मया ततमिदं सर्वं जगदव्यक्तमूर्तिना ।\nमत्स्थानि सर्वभूतानि न चाहं तेष्ववस्थितः ॥९-४॥',
            'meaning':
                'यह सम्पूर्ण जगत् मुझ (परमात्मा) के अव्यक्त स्वरूप से व्याप्त है, भूतमात्र मुझमें स्थित है, परन्तु मैं उनमें स्थित नहीं हूं ।',
          },
          {
            'no': 5,
            'shlok':
                'न च मत्स्थानि भूतानि पश्य मे योगमैश्वरम् ।\nभूतभृन्न च भूतस्थो ममात्मा भूतभावनः ॥९-५॥',
            'meaning':
                'और (वस्तुत:) भूतमात्र मुझ में स्थित नहीं है; मेरे ईश्वरीय योग को देखो कि भूतों को धारण करने वाली और भूतों को उत्पन्न करने वाली मेरी आत्मा उन भूतों में स्थित नहीं है ।',
          },
          {
            'no': 6,
            'shlok':
                'यथाकाशस्थितो नित्यं वायुः सर्वत्रगो महान् ।\nतथा सर्वाणि भूतानि मत्स्थानीत्युपधारय ॥९-६॥',
            'meaning':
                'जैसे सर्वत्र विचरण करने वाली महान् वायु सदा आकाश में स्थित रहती हैं, वैसे ही सम्पूर्ण भूत मुझमें स्थित हैं, ऐसा तुम जानो ।',
          },
          {
            'no': 7,
            'shlok':
                'सर्वभूतानि कौन्तेय प्रकृतिं यान्ति मामिकाम् ।\nकल्पक्षये पुनस्तानि कल्पादौ विसृजाम्यहम् ॥९-७॥',
            'meaning':
                'हे कुन्तीपुत्र! कल्प का अन्त होने पर सारे प्राणी मेरी प्रकृति में प्रवेश करते हैं और अन्य कल्प के आरम्भ होने पर मैं उन्हें अपनी शक्ति से पुनः उत्पन्न करता हूँ ।',
          },
          {
            'no': 8,
            'shlok':
                'प्रकृतिं स्वामवष्टभ्य विसृजामि पुनः पुनः ।\nभूतग्राममिमं कृत्स्नमवशं प्रकृतेर्वशात् ॥९-८॥',
            'meaning':
                'सम्पूर्ण विराट जगत मेरे अधीन है । यह मेरी इच्छा से बारम्बार स्वतः प्रकट होता रहता है और मेरी ही इच्छा से अन्त में विनष्ट होता है ।',
          },
          {
            'no': 9,
            'shlok':
                'न च मां तानि कर्माणि निबध्नन्ति धनंजय ।\nउदासीनवदासीनमसक्तं तेषु कर्मसु ॥९-९॥',
            'meaning':
                'हे धनञ्जय! ये सारे कर्म मुझे नहीं बाँध पाते हैं । मैं उदासीन की भाँति इन सारे भौतिक कर्मों से सदैव विरक्त रहता हूँ ।',
          },
          {
            'no': 10,
            'shlok':
                'मयाध्यक्षेण प्रकृतिः सूयते सचराचरम् ।\nहेतुनानेन कौन्तेय जगद्विपरिवर्तते ॥९-१०॥',
            'meaning':
                'हे कुन्तीपुत्र! यह भौतिक प्रकृति मेरी शक्तियों में से एक है और मेरी अध्यक्षता में कार्य करती है, जिससे सारे चर तथा अचर प्राणी उत्पन्न होते हैं । इसके शासन में यह जगत् बारम्बार सृजित और विनष्ट होता रहता है ।',
          },
          {
            'no': 11,
            'shlok':
                'अवजानन्ति मां मूढा मानुषीं तनुमाश्रितम् ।\nपरं भावमजानन्तो मम भूतमहेश्वरम् ॥९-११॥',
            'meaning':
                'जब मैं मनुष्य रूप में अवतरित होता हूँ, तो मूर्ख मेरा उपहास करते हैं । वे मुझ परमेश्र्वर के दिव्य स्वभाव को नहीं जानते ।',
          },
          {
            'no': 12,
            'shlok':
                'मोघाशा मोघकर्माणो मोघज्ञाना विचेतसः ।\nराक्षसीमासुरीं चैव प्रकृतिं मोहिनीं श्रिताः ॥९-१२॥',
            'meaning':
                'जो लोग इस प्रकार मोहग्रस्त होते हैं, वे आसुरी तथा नास्तिक विचारों के प्रति आकृष्ट रहते हैं । इस मोहग्रस्त अवस्था में उनकी मुक्ति-आशा, उनके सकाम कर्म तथा ज्ञान का अनुशीलन सभी निष्फल हो जाते हैं ।',
          },
          {
            'no': 13,
            'shlok':
                'महात्मानस्तु मां पार्थ दैवीं प्रकृतिमाश्रिताः ।\nभजन्त्यनन्यमनसो ज्ञात्वा भूतादिमव्ययम् ॥९-१३॥',
            'meaning':
                'हे पार्थ! मोहमुक्त महात्माजन दैवी प्रकृति के संरक्षण में रहते हैं । वे पूर्णतः भक्ति में निमग्न रहते हैं क्योंकि वे मुझे आदि तथा अविनाशी भगवान् के रूप में जानते हैं ।',
          },
          {
            'no': 14,
            'shlok':
                'सततं कीर्तयन्तो मां यतन्तश्च दृढव्रताः ।\nनमस्यन्तश्च मां भक्त्या नित्ययुक्ता उपासते ॥९-१४॥',
            'meaning':
                'ये महात्मा मेरी महिमा का नित्य कीर्तन करते हुए दृढसंकल्प के साथप्रयास करते हुए, मुझे नमस्कार करते हुए, भक्तिभाव से निरन्तर मेरी पूजा करते हैं ।',
          },
          {
            'no': 15,
            'shlok':
                'ज्ञानयज्ञेन चाप्यन्ये यजन्तो मामुपासते ।\nएकत्वेन पृथक्त्वेन बहुधा विश्वतोमुखम् ॥९-१५॥',
            'meaning':
                'अन्य लोग जो ज्ञान के अनुशीलन द्वारा यज्ञ में लगे रहते हैं, वे भगवान् की पूजा उनके अद्वय रूप में, विविध रूपों में तथा विश्र्व रूप में करते हैं ।',
          },
          {
            'no': 16,
            'shlok':
                'अहं क्रतुरहं यज्ञः स्वधाहमहमौषधम् ।\nमन्त्रोऽहमहमेवाज्यमहमग्निरहं हुतम् ॥९-१६॥',
            'meaning':
                'किन्तु मैं ही कर्मकाण्ड, मैं ही यज्ञ, पितरों को दिया जाने वाला अर्पण, औषधि, दिव्य ध्वनि (मन्त्र), घी, अग्नि तथा आहुति हूँ ।',
          },
          {
            'no': 17,
            'shlok':
                'पिताहमस्य जगतो माता धाता पितामहः ।\nवेद्यं पवित्रमोंकार ऋक्साम यजुरेव च ॥९-१७॥',
            'meaning':
                'मैं इस ब्रह्माण्ड का पिता, माता, आश्रय तथा पितामह हूँ । मैं ज्ञेय (जानने योग्य), शुद्धिकर्ता तथा ओंकार हूँ । मैं ऋग्वेद, सामवेद तथा यजुर्वेद भी हूँ ।',
          },
          {
            'no': 18,
            'shlok':
                'गतिर्भर्ता प्रभुः साक्षी निवासः शरणं सुहृत् ।\nप्रभवः प्रलयः स्थानं निधानं बीजमव्ययम् ॥९-१८॥',
            'meaning':
                'मैं ही लक्ष्य, पालनकर्ता, स्वामी, साक्षी, धाम, शरणस्थली तथा अत्यन्तप्रिय मित्र हूँ । मैं सृष्टि तथा प्रलय, सबका आधार, आश्रय तथा अविनाशी बीज भी हूँ ।',
          },
          {
            'no': 19,
            'shlok':
                'तपाम्यहमहं वर्षं निगृह्णाम्युत्सृजामि च ।\nअमृतं चैव मृत्युश्च सदसच्चाहमर्जुन ॥९-१९॥',
            'meaning':
                'हे अर्जुन! मैं ही ताप प्रदान करता हूँ और वर्षा को रोकता तथा लाता हूँ । मैं अमरत्व हूँ और साक्षात् मृत्यु भी हूँ । आत्मा तथा पदार्थ (सत् तथा असत्) दोनों मुझ ही में हैं ।',
          },
          {
            'no': 20,
            'shlok':
                'त्रैविद्या मां सोमपाः पूतपापा यज्ञैरिष्ट्वा स्वर्गतिं प्रार्थयन्ते ।\nते पुण्यमासाद्य सुरेन्द्रलोकमश्नन्ति दिव्यान्दिवि देवभोगान् ॥९-२०॥',
            'meaning':
                'जो वेदों का अध्ययन करते तथा सोमरस का पान करते हैं, वे स्वर्ग प्राप्ति की गवेषणा करते हुए अप्रत्यक्ष रूप से मेरी पूजा करते हैं । वे पापकर्मों से शुद्ध होकर, इन्द्र के पवित्र स्वर्गिक धाम में जन्म लेते हैं, जहाँ वे देवताओं का सा आनन्द भोगते हैं ।',
          },
          {
            'no': 21,
            'shlok':
                'ते तं भुक्त्वा स्वर्गलोकं विशालं क्षीणे पुण्ये मर्त्यलोकं विशन्ति ।\nएवं त्रयीधर्ममनुप्रपन्ना गतागतं कामकामा लभन्ते ॥९-२१॥',
            'meaning':
                'इस प्रकार जब वे (उपासक) विस्तृत स्वर्गिक इन्द्रियसुख को भोग लेते हैं और उनके पुण्यकर्मों के फल क्षीण हो जाते हैं तो वे मृत्युलोक में पुनः लौट आते हैं । इस प्रकार जो तीनों वेदों के सिद्धान्तों में दृढ रहकर इन्द्रियसुख की गवेषणा करते हैं, उन्हें जन्म-मृत्यु का चक्र ही मिल पाता है ।',
          },
          {
            'no': 22,
            'shlok':
                'अनन्याश्चिन्तयन्तो मां ये जनाः पर्युपासते ।\nतेषां नित्याभियुक्तानां योगक्षेमं वहाम्यहम् ॥९-२२॥',
            'meaning':
                'किन्तु जो लोग अनन्यभाव से मेरे दिव्यस्वरूप का ध्यान करते हुए निरन्तर मेरी पूजा करते हैं, उनकी जो आवश्यकताएँ होती हैं, उन्हें मैं पूरा करता हूँ और जो कुछ उनके पास है, उसकी रक्षा करता हूँ ।',
          },
          {
            'no': 23,
            'shlok':
                'येऽप्यन्यदेवताभक्ता यजन्ते श्रद्धयान्विताः ।\nतेऽपि मामेव कौन्तेय यजन्त्यविधिपूर्वकम् ॥९-२३॥',
            'meaning':
                'हे कुन्तीपुत्र! जो लोग अन्य देवताओं के भक्त हैं और उनकी श्रद्धापूर्वक पूजा करते हैं, वास्तव में वे भी मेरी पूजा करते हैं, किन्तु वे यह त्रुटिपूर्ण ढंग से करते हैं ।',
          },
          {
            'no': 24,
            'shlok':
                'अहं हि सर्वयज्ञानां भोक्ता च प्रभुरेव च ।\nन तु मामभिजानन्ति तत्त्वेनातश्च्यवन्ति ते ॥९-२४॥',
            'meaning':
                'मैं ही समस्त यज्ञों का एकमात्र भोक्ता तथा स्वामी हूँ । अतः जो लोग मेरे वास्तविक दिव्य स्वभाव को नहीं पहचान पाते, वे नीचे गिर जाते हैं ।',
          },
          {
            'no': 25,
            'shlok':
                'यान्ति देवव्रता देवान्पितॄन्यान्ति पितृव्रताः ।\nभूतानि यान्ति भूतेज्या यान्ति मद्याजिनोऽपि माम् ॥९-२५॥',
            'meaning':
                'जो देवताओं की पूजा करते हैं, वे देवताओं के बीच जन्म लेंगे, जो पितरों को पूजते हैं, वे पितरों के पास जाते हैं, जो भूत-प्रेतों की उपासना करते हैं, वे उन्हीं के बीच जन्म लेते हैं और जो मेरी पूजा करते हैं वे मेरे साथ निवास करते हैं ।',
          },
          {
            'no': 26,
            'shlok':
                'पत्रं पुष्पं फलं तोयं यो मे भक्त्या प्रयच्छति ।\nतदहं भक्त्युपहृतमश्नामि प्रयतात्मनः ॥९-२६॥',
            'meaning':
                'यदि कोई प्रेम तथा भक्ति के साथ मुझे पत्र, पुष्प, फल या जल प्रदान करता है, तो मैं उसे स्वीकार करता हूँ ।',
          },
          {
            'no': 27,
            'shlok':
                'यत्करोषि यदश्नासि यज्जुहोषि ददासि यत् ।\nयत्तपस्यसि कौन्तेय तत्कुरुष्व मदर्पणम् ॥९-२७॥',
            'meaning':
                'हे कुन्तीपुत्र! तुम जो कुछ करते हो, जो कुछ खाते हो, जो कुछ अर्पित करते हो या दान देते हो और जो भी तपस्या करते हो, उसे मुझे अर्पित करते हुए करो ।',
          },
          {
            'no': 28,
            'shlok':
                'शुभाशुभफलैरेवं मोक्ष्यसे कर्मबन्धनैः ।\nसंन्यासयोगयुक्तात्मा विमुक्तो मामुपैष्यसि ॥९-२८॥',
            'meaning':
                'इस तरह तुम कर्म के बन्धन तथा इसके शुभाशुभ फलों से मुक्त हो सकोगे । इस संन्यासयोग में अपने चित्त को स्थिर करके तुम मुक्त होकर मेरे पास आ सकोगे ।',
          },
          {
            'no': 29,
            'shlok':
                'समोऽहं सर्वभूतेषु न मे द्वेष्योऽस्ति न प्रियः ।\nये भजन्ति तु मां भक्त्या मयि ते तेषु चाप्यहम् ॥९-२९॥',
            'meaning':
                'मैं न तो किसी से द्वेष करता हूँ, न ही किसी के साथ पक्षपात करता हूँ । मैं सबों के लिए समभाव हूँ । किन्तु जो भी भक्तिपूर्वक मेरी सेवा करता है, वह मेरा मित्र है, मुझमें स्थित रहता है और मैं भी उसका मित्र हूँ ।',
          },
          {
            'no': 30,
            'shlok':
                'अपि चेत्सुदुराचारो भजते मामनन्यभाक् ।\nसाधुरेव स मन्तव्यः सम्यग्व्यवसितो हि सः ॥९-३०॥',
            'meaning':
                'यदि कोई जघन्य से जघन्य कर्म करता है, किन्तु यदि वह भक्ति में रत रहता है तो उसे साधु मानना चाहिए, क्योंकि वह अपने संकल्प में अडिग रहता है ।',
          },
          {
            'no': 31,
            'shlok':
                'क्षिप्रं भवति धर्मात्मा शश्वच्छान्तिं निगच्छति ।\nकौन्तेय प्रति जानीहि न मे भक्तः प्रणश्यति ॥९-३१॥',
            'meaning':
                'वह तुरन्त धर्मात्मा बन जाता है और स्थायी शान्ति को प्राप्त होता है । हे कुन्तीपुत्र! निडर होकर घोषणा कर दो कि मेरे भक्त का कभी विनाश नहीं होता है ।',
          },
          {
            'no': 32,
            'shlok':
                'मां हि पार्थ व्यपाश्रित्य येऽपि स्युः पापयोनयः ।\nस्त्रियो वैश्यास्तथा शूद्रास्तेऽपि यान्ति परां गतिम् ॥९-३२॥',
            'meaning':
                'हे पार्थ! जो लोग मेरी शरण ग्रहण करते हैं, वे भले ही निम्नजन्मा स्त्री, वैश्य (व्यापारी) तथा शुद्र (श्रमिक) क्यों न हों, वे परमधाम को प्राप्त करते हैं ।',
          },
          {
            'no': 33,
            'shlok':
                'किं पुनर्ब्राह्मणाः पुण्या भक्ता राजर्षयस्तथा ।\nअनित्यमसुखं लोकमिमं प्राप्य भजस्व माम् ॥९-३३॥',
            'meaning':
                'फिर धर्मात्मा ब्राह्मणों, भक्तों तथा राजर्षियों के लिए तो कहना ही क्या है! अतः इस क्षणिक दुखमय संसार में आ जाने पर मेरी प्रेमाभक्ति में अपने आपको लगाओ ।',
          },
          {
            'no': 34,
            'shlok':
                'मन्मना भव मद्भक्तो मद्याजी मां नमस्कुरु ।\nमामेवैष्यसि युक्त्वैवमात्मानं मत्परायणः ॥९-३४॥',
            'meaning':
                'अपने मन को मेरे नित्य चिन्तन में लगाओ, मेरे भक्त बनो, मुझे नमस्कार करो और मेरी ही पूजा करो । इस प्रकार मुझमें पूर्णतया तल्लीन होने पर तुम निश्चित रूप से मुझको प्राप्त होगे ।',
          },
        ],
      },
      //chapter 10
      {
        'id': 'दसवाँ अध्याय',
        'name': 'विभूतियोग',
        'shloks': [
          {
            'no': 1,
            'shlok':
                'भूय एव महाबाहो शृणु मे परमं वचः ।\nयत्तेऽहं प्रीयमाणाय वक्ष्यामि हितकाम्यया ॥१०-१॥',
            'meaning':
                'श्रीभगवान् ने कहा – हे महाबाहु अर्जुन! और आगे सुनो । चूँकि तुम मेरे प्रिय सखा हो, अतः मैं तुम्हारे लाभ के लिए ऐसा ज्ञान प्रदान करूँगा, जो अभी तक मेरे द्वारा बताये गये ज्ञान से श्रेष्ठ होगा ।',
          },
          {
            'no': 2,
            'shlok':
                'न मे विदुः सुरगणाः प्रभवं न महर्षयः ।\nअहमादिर्हि देवानां महर्षीणां च सर्वशः ॥१०-२॥',
            'meaning':
                'न तो देवतागण मेरी उत्पत्ति या ऐश्र्वर्य को जानते हैं और न महर्षिगण ही जानते हैं, क्योंकि मैं सभी प्रकार से देवताओं और महर्षियों का भी कारणस्वरूप (उद्गम) हूँ ।',
          },
          {
            'no': 3,
            'shlok':
                'जमनादिं च वेत्ति लोकमहेश्वरम् ।\nअसंमूढः स मर्त्येषु सर्वपापैः प्रमुच्यते ॥१०-३॥',
            'meaning':
                'जो मुझे अजन्मा, अनादि, समस्त लोकों के स्वामी के रूप में जानता है, मनुष्यों में केवल वही मोहरहित और समस्त पापों से मुक्त होता है ।',
          },
          {
            'no': 4,
            'shlok':
                'बुद्धिर्ज्ञानमसंमोहः क्षमा सत्यं दमः शमः ।\nसुखं दुःखं भवोऽभावो भयं चाभयमेव च ॥१०-४॥',
            'meaning':
                'बुद्धि, ज्ञान, मोह का अभाव, क्षमा, सत्य, दम (इन्द्रिय संयम), शम (मन: संयम), सुख, दु:ख, जन्म और मृत्यु, भय और अभय ।',
          },
          {
            'no': 5,
            'shlok':
                'अहिंसा समता तुष्टिस्तपो दानं यशोऽयशः ।\nभवन्ति भावा भूतानां मत्त एव पृथग्विधाः ॥१०-५॥',
            'meaning':
                'अहिंसा, समता, सन्तोष, तप, दान. यश और अपयश ऐसे ये प्राणियों के नानाविध भाव मुझ से ही प्रकट होते हैं ।',
          },
          {
            'no': 6,
            'shlok':
                'महर्षयः सप्त पूर्वे चत्वारो मनवस्तथा ।\nमद्भावा मानसा जाता येषां लोक इमाः प्रजाः ॥१०-६॥',
            'meaning':
                'सप्तर्षिगण तथा उनसे भी पूर्व चार अन्य महर्षि एवं सारे मनु (मानवजाति के पूर्वज) सब मेरे मन से उत्पन्न हैं और विभिन्न लोकों में निवास करने वाले सारे जीव उनसे अवतरित होते हैं ।',
          },
          {
            'no': 7,
            'shlok':
                'एतां विभूतिं योगं च मम यो वेत्ति तत्त्वतः ।\nसोऽविकम्पेन योगेन युज्यते नात्र संशयः ॥१०-७॥',
            'meaning':
                'जो मेरे इस ऐश्र्वर्य तथा योग से पूर्णतया आश्र्वस्त है, वह मेरी अनन्य भक्ति में तत्पर होता है । इसमें तनिक भी सन्देह नहीं है ।',
          },
          {
            'no': 8,
            'shlok':
                'अहं सर्वस्य प्रभवो मत्तः सर्वं प्रवर्तते ।\nइति मत्वा भजन्ते मां बुधा भावसमन्विताः ॥१०-८॥',
            'meaning':
                'मैं समस्त आध्यात्मिक तथा भौतिक जगतों का कारण हूँ, प्रत्येक वस्तु मुझ ही से उद्भूत है । जो बुद्धिमान यह भलीभाँति जानते हैं, वे मेरी प्रेमाभक्ति में लगते हैं तथा हृदय से पूरी तरह मेरी पूजा में तत्पर होते हैं ।',
          },
          {
            'no': 9,
            'shlok':
                'मच्चित्ता मद्गतप्राणा बोधयन्तः परस्परम् ।\nकथयन्तश्च मां नित्यं तुष्यन्ति च रमन्ति च ॥१०-९॥',
            'meaning':
                'मेरे शुद्ध भक्तों के विचार मुझमें वास करते हैं, उनके जीवन मेरी सेवा में अर्पित रहते हैं और वे एक दूसरे को ज्ञान प्रदान करते तथा मेरे विषय में बातें करते हुए परमसन्तोष तथा आनन्द का अनुभव करते हैं ।',
          },
          {
            'no': 10,
            'shlok':
                'तेषां सततयुक्तानां भजतां प्रीतिपूर्वकम् ।\nददामि बुद्धियोगं तं येन मामुपयान्ति ते ॥१०-१०॥',
            'meaning':
                'जो प्रेमपूर्वक मेरी सेवा करने में निरन्तर लगे रहते हैं, उन्हें मैं ज्ञान प्रदान करता हूँ, जिसके द्वारा वे मुझ तक आ सकते हैं ।',
          },
          {
            'no': 11,
            'shlok':
                'तेषामेवानुकम्पार्थमहमज्ञानजं तमः ।\nनाशयाम्यात्मभावस्थो ज्ञानदीपेन भास्वता ॥१०-११॥',
            'meaning':
                'मैं उन पर विशेष कृपा करने के हेतु उनके हृदयों में वास करते हुए ज्ञान के प्रकाशमान दीपक के द्वारा अज्ञानजन्य अंधकार को दूर करता हूँ ।',
          },
          {
            'no': 12,
            'shlok':
                'परं ब्रह्म परं धाम पवित्रं परमं भवान् ।\nपुरुषं शाश्वतं दिव्यमादिदेवमजं विभुम् ॥१०-१२॥',
            'meaning':
                'अर्जुन ने कहा आप - परम ब्रह्म, परम धाम और परम पवित्र हंै; सनातन दिव्य पुरुष, देवों के भी आदि देव, जन्म रहित और सर्वव्यापी हैं ।',
          },
          {
            'no': 13,
            'shlok':
                'आहुस्त्वामृषयः सर्वे देवर्षिर्नारदस्तथा ।\nअसितो देवलो व्यासः स्वयं चैव ब्रवीषि मे ॥१०-१३॥',
            'meaning':
                'ऐसा आपको समस्त ऋषिजन कहते हैं; वैसे ही देवर्षि नारद, असित, देवल ऋषि तथा व्यास और स्वयं आप भी मेरे प्रति कहते हैं ।',
          },
          {
            'no': 14,
            'shlok':
                'सर्वमेतदृतं मन्ये यन्मां वदसि केशव ।\nन हि ते भगवन्व्यक्तिं विदुर्देवा न दानवाः ॥१०-१४॥',
            'meaning':
                'हे कृष्ण! आपने मुझसे जो कुछ कहा है, उसे मैं पूर्णतया सत्य मानता हूँ । हे प्रभु! न तो देवतागण, न असुरगण ही आपके स्वरूप को समझ सकते हैं ।',
          },
          {
            'no': 15,
            'shlok':
                'स्वयमेवात्मनात्मानं वेत्थ त्वं पुरुषोत्तम ।\nभूतभावन भूतेश देवदेव जगत्पते ॥१०-१५॥',
            'meaning':
                'हे परमपुरुष, हे सबके उद्गम, हे समस्त प्राणियों के स्वामी, हे देवों के देव, हे ब्रह्माण्ड के प्रभु! निस्सन्देह एकमात्र आप ही अपने को अपनी अन्तरंगाशक्ति से जानने वाले हैं ।',
          },
          {
            'no': 16,
            'shlok':
                'वक्तुमर्हस्यशेषेण दिव्या ह्यात्मविभूतयः ।\nयाभिर्विभूतिभिर्लोकानिमांस्त्वं व्याप्य तिष्ठसि ॥१०-१६॥',
            'meaning':
                'आप ही उन अपनी दिव्य विभूतियों को अशेषत: कहने के लिए योग्य हैं, जिन विभूतियों के द्वारा इन समस्त लोकों को आप व्याप्त करके स्थित हैं ।',
          },
          {
            'no': 17,
            'shlok':
                'कथं विद्यामहं योगिंस्त्वां सदा परिचिन्तयन् ।\nकेषु केषु च भावेषु चिन्त्योऽसि भगवन्मया ॥१०-१७॥',
            'meaning':
                'हे कृष्ण, हे परम योगी! मैं किस तरह आपका निरन्तर चिन्तन करूँ और आपको कैसे जानूँ? हे भगवान्! आपका स्मरण किन-किन रूपों में किया जाय?',
          },
          {
            'no': 18,
            'shlok':
                'विस्तरेणात्मनो योगं विभूतिं च जनार्दन ।\nभूयः कथय तृप्तिर्हि शृण्वतो नास्ति मेऽमृतम् ॥१०-१८॥',
            'meaning':
                'हे जनार्दन! आप पुनः विस्तार से अपने ऐश्र्वर्य तथा योगशक्ति का वर्णन करें । मैं आपके विषय में सुनकर कभी तृप्त नहीं होता हूँ, क्योंकि जितना ही आपके विषय में सुनता हूँ, उतना ही आपके शब्द-अमृत को चखना चाहता हूँ ।',
          },
          {
            'no': 19,
            'shlok':
                'हन्त ते कथयिष्यामि दिव्या ह्यात्मविभूतयः ।\nप्राधान्यतः कुरुश्रेष्ठ नास्त्यन्तो विस्तरस्य मे ॥१०-१९॥',
            'meaning':
                'श्रीभगवान् ने कहा – हाँ, अब मैं तुमसे अपने मुख्य-मुख्य वैभवयुक्त रूपों का वर्णन करूँगा, क्योंकि हे अर्जुन! मेरा ऐश्र्वर्य असीम है ।',
          },
          {
            'no': 20,
            'shlok':
                'अहमात्मा गुडाकेश सर्वभूताशयस्थितः ।\nअहमादिश्च मध्यं च भूतानामन्त एव च ॥१०-२०॥',
            'meaning':
                'हे अर्जुन! मैं समस्त जीवों के हृदयों में स्थित परमात्मा हूँ । मैं ही समस्त जीवों का आदि, मध्य तथा अन्त हूँ ।',
          },
          {
            'no': 21,
            'shlok':
                'आदित्यानामहं विष्णुर्ज्योतिषां रविरंशुमान् ।\nमरीचिर्मरुतामस्मि नक्षत्राणामहं शशी ॥१०-२१॥',
            'meaning':
                'मैं आदित्यों में विष्णु, प्रकाशों में तेजस्वी सूर्य, मरुतों में मरीचि तथा नक्षत्रों में चन्द्रमा हूँ ।',
          },
          {
            'no': 22,
            'shlok':
                'वेदानां सामवेदोऽस्मि देवानामस्मि वासवः ।\nइन्द्रियाणां मनश्चास्मि भूतानामस्मि चेतना ॥१०-२२॥',
            'meaning':
                'मैं वेदों में सामवेद हूँ, देवों में स्वर्ग का राजा इन्द्र हूँ, इन्द्रियों में मन हूँ, तथा समस्त जीवों में जीवनशक्ति (चेतना) हूँ ।',
          },
          {
            'no': 23,
            'shlok':
                'रुद्राणां शंकरश्चास्मि वित्तेशो यक्षरक्षसाम् ।\nवसूनां पावकश्चास्मि मेरुः शिखरिणामहम् ॥१०-२३॥',
            'meaning':
                'मैं समस्त रुद्रों में शिव हूँ, यक्षों तथा राक्षसों में सम्पत्ति का देवता (कुबेर) हूँ, वसुओं में अग्नि हूँ और समस्त पर्वतों में मेरु हूँ ।',
          },
          {
            'no': 24,
            'shlok':
                'पुरोधसां च मुख्यं मां विद्धि पार्थ बृहस्पतिम् ।\nसेनानीनामहं स्कन्दः सरसामस्मि सागरः ॥१०-२४॥',
            'meaning':
                'हे अर्जुन! मुझे समस्त पुरोहितों में मुख्य पुरोहित ब्रहस्पति जानो । मैं ही समस्त सेनानायकों में कार्तिकेय हूँ और समस्त जलाशयों में समुद्र हूँ ।',
          },
          {
            'no': 25,
            'shlok':
                'महर्षीणां भृगुरहं गिरामस्म्येकमक्षरम् ।\nयज्ञानां जपयज्ञोऽस्मि स्थावराणां हिमालयः ॥१०-२५॥',
            'meaning':
                'मैं महर्षियों में भृगु हूँ, वाणी में दिव्य ओंकार हूँ, समस्त यज्ञों में पवित्र नाम का कीर्तन (जप) तथा समस्त अचलों में हिमालय हूँ ।',
          },
          {
            'no': 26,
            'shlok':
                'अश्वत्थः सर्ववृक्षाणां देवर्षीणां च नारदः ।\nगन्धर्वाणां चित्ररथः सिद्धानां कपिलो मुनिः ॥१०-२६॥',
            'meaning':
                'मैं समस्त वृक्षों में अश्र्वत्थ हूँ और देवर्षियों में नारद हूँ । मैं गन्धर्वों में चित्ररथ हूँ और सिद्ध पुरुषों में कपिल मुनि हूँ ।',
          },
          {
            'no': 27,
            'shlok':
                'उच्चैःश्रवसमश्वानां विद्धि माममृतोद्भवम् ।\nऐरावतं गजेन्द्राणां नराणां च नराधिपम् ॥१०-२७॥',
            'meaning':
                'घोड़ो में मुझे उच्चैःश्रवा जानो, जो अमृत के लिए समुद्र मन्थन के समय उत्पन्न हुआ था । गजराजों में मैं ऐरावत हूँ तथा मनुष्यों में राजा हूँ ।',
          },
          {
            'no': 28,
            'shlok':
                'आयुधानामहं वज्रं धेनूनामस्मि कामधुक् ।\nप्रजनश्चास्मि कन्दर्पः सर्पाणामस्मि वासुकिः ॥१०-२८॥',
            'meaning':
                'मैं हथियारों में वज्र हूँ, गायों में सुरभि, सन्तति उत्पत्ति के कारणों में प्रेम के देवता कामदेव तथा सर्पों में वासुकि हूँ ।',
          },
          {
            'no': 29,
            'shlok':
                'अनन्तश्चास्मि नागानां वरुणो यादसामहम् ।\nपितॄणामर्यमा चास्मि यमः संयमतामहम् ॥१०-२९॥',
            'meaning':
                'अनेक फणों वाले नागों में मैं अनन्त हूँ और जलचरों में वरुणदेव हूँ । मैं पितरों में अर्यमा हूँ तथा नियमों के निर्वाहकों में मैं मृत्युराज यम हूँ ।',
          },
          {
            'no': 30,
            'shlok':
                'प्रह्लादश्चास्मि दैत्यानां कालः कलयतामहम् ।\nमृगाणां च मृगेन्द्रोऽहं वैनतेयश्च पक्षिणाम् ॥१०-३०॥',
            'meaning':
                'दैत्यों में मैं भक्तराज प्रह्लाद हूँ, दमन करने वालों में काल हूँ, पशुओं में सिंह हूँ, तथा पक्षियों में गरुड़ हूँ ।',
          },
          {
            'no': 31,
            'shlok':
                'पवनः पवतामस्मि रामः शस्त्रभृतामहम् ।\nझषाणां मकरश्चास्मि स्रोतसामस्मि जाह्नवी ॥१०-३१॥',
            'meaning':
                'समस्त पवित्र करने वालों में मैं वायु हूँ, शस्त्रधारियों में राम, मछलियों में मगर तथा नदियों में गंगा हूँ ।',
          },
          {
            'no': 32,
            'shlok':
                'सर्गाणामादिरन्तश्च मध्यं चैवाहमर्जुन ।\nअध्यात्मविद्या विद्यानां वादः प्रवदतामहम् ॥१०-३२॥',
            'meaning':
                'हे अर्जुन! मैं समस्त सृष्टियों का आदि, मध्य और अन्त हूँ । मैं समस्त विद्याओं में अध्यात्म विद्या हूँ और तर्कशास्त्रियों में मैं निर्णायक सत्य हूँ ।',
          },
          {
            'no': 33,
            'shlok':
                'अक्षराणामकारोऽस्मि द्वन्द्वः सामासिकस्य च ।\nअहमेवाक्षयः कालो धाताहं विश्वतोमुखः ॥१०-३३॥',
            'meaning':
                'अक्षरों में मैं अकार हूँ और समासों में द्वन्द्व समास हूँ । मैं शाश्र्वत काल भी हूँ और स्त्रष्टाओं में ब्रह्मा हूँ ।',
          },
          {
            'no': 34,
            'shlok':
                'मृत्युः सर्वहरश्चाहमुद्भवश्च भविष्यताम् ।\nकीर्तिः श्रीर्वाक्च नारीणां स्मृतिर्मेधा धृतिः क्षमा ॥१०-३४॥',
            'meaning':
                'मैं सर्वभक्षी मृत्यु हूँ और मैं ही आगे होने वालों को उत्पन्न करने वाला हूँ । स्त्रियों में मैं कीर्ति, श्री, वाक्, स्मृति, मेधा, धृति तथा क्षमा हूँ ।',
          },
          {
            'no': 35,
            'shlok':
                'बृहत्साम तथा साम्नां गायत्री छन्दसामहम् ।\nमासानां मार्गशीर्षोऽहमृतूनां कुसुमाकरः ॥१०-३५॥',
            'meaning':
                'मैं सामवेद के गीतों में बृहत्साम हूँ और छन्दों में गायत्री हूँ । समस्त महीनों में मैं मार्गशीर्ष (अगहन) तथा समस्त ऋतुओं में फूल खिलने वाली वसन्त ऋतु हूँ ।',
          },
          {
            'no': 36,
            'shlok':
                'द्यूतं छलयतामस्मि तेजस्तेजस्विनामहम् ।\nजयोऽस्मि व्यवसायोऽस्मि सत्त्वं सत्त्ववतामहम् ॥१०-३६॥',
            'meaning':
                'मैं छलियों में जुआ हूँ और तेजस्वियों में तेज हूँ । मैं विजय हूँ, साहस हूँ और बलवानों का बल हूँ ।',
          },
          {
            'no': 37,
            'shlok':
                'वृष्णीनां वासुदेवोऽस्मि पाण्डवानां धनंजयः ।\nमुनीनामप्यहं व्यासः कवीनामुशना कविः ॥१०-३७॥',
            'meaning':
                'मैं वृष्णिवंशियों में वासुदेव और पाण्डवों में अर्जुन हूँ । मैं समस्त मुनियों में व्यास तथा महान विचारकों में उशना हूँ ।',
          },
          {
            'no': 38,
            'shlok':
                'दण्डो दमयतामस्मि नीतिरस्मि जिगीषताम् ।\nमौनं चैवास्मि गुह्यानां ज्ञानं ज्ञानवतामहम् ॥१०-३८॥',
            'meaning':
                'अराजकता को दमन करने वाले समस्त साधनों में मैं दण्ड हूँ और जो विजय के आकांक्षी हैं उनकी मैं नीति हूँ । रहस्यों में मैं मौन हूँ और बुद्धिमानों में ज्ञान हूँ ।',
          },
          {
            'no': 39,
            'shlok':
                'यच्चापि सर्वभूतानां बीजं तदहमर्जुन ।\nन तदस्ति विना यत्स्यान्मया भूतं चराचरम् ॥१०-३९॥',
            'meaning':
                'हे अर्जुन! मैं समस्त सृष्टि का जनक बीज हूँ । ऐसा चर तथा अचर कोई भी प्राणी नहीं है, जो मेरे बिना रह सके ।',
          },
          {
            'no': 40,
            'shlok':
                'नान्तोऽस्ति मम दिव्यानां विभूतीनां परन्तप ।\nएष तूद्देशतः प्रोक्तो विभूतेर्विस्तरो मया ॥१०-४०॥',
            'meaning':
                'हे परन्तप! मेरी दैवी विभूतियों का अन्त नहीं है । मैंने तुमसे जो कुछ कहा, वह तो मेरी अनन्त विभूतियों का संकेत मात्र है ।',
          },
          {
            'no': 41,
            'shlok':
                'यद्यद्विभूतिमत्सत्त्वं श्रीमदूर्जितमेव वा ।\nतत्तदेवावगच्छ त्वं मम तेजोंऽशसंभवम् ॥१०-४१॥',
            'meaning':
                'तुम जान लो कि सारा ऐश्र्वर्य, सौन्दर्य तथा तेजस्वी सृष्टियाँ मेरे तेज के एक स्फुलिंग मात्र से उद्भूत हैं ।',
          },
          {
            'no': 42,
            'shlok':
                'अथवा बहुनैतेन किं ज्ञातेन तवार्जुन ।\nविष्टभ्याहमिदं कृत्स्नमेकांशेन स्थितो जगत् ॥१०-४२॥',
            'meaning':
                'किन्तु हे अर्जुन! इस सारे विशद ज्ञान की आवश्यकता क्या है? मैं तो अपने एक अंश मात्र से सम्पूर्ण ब्रह्माण्ड में व्याप्त होकर इसको धारण करता हूँ ।',
          },
        ],
      },
      //chapter 11
      {
        'id': 'ग्यारहवाँ अध्याय',
        'name': 'विश्वरूपदर्शनयोग',
        'shloks': [
          {
            'shlok': '',
            'meaning': '',
          },
        ],
      },
      //chapter 12
      {
        'id': 'बारहवाँ अध्याय',
        'name': 'भक्तियोग',
        'shloks': [
          {
            'no': 1,
            'shlok':
                'एवं सततयुक्ता ये भक्तास्त्वां पर्युपासते ।\nये चाप्यक्षरमव्यक्तं तेषां के योगवित्तमाः ॥१२-१॥',
            'meaning':
                'अर्जुन ने पूछा – जो आपकीसेवा में सदैव तत्पर रहते हैं, या जो अव्यक्त निर्विशेष ब्रह्म की पूजाकरते हैं, इन दोनों में से किसे अधिक पूर्ण (सिद्ध) माना जाय?',
          },
          {
            'no': 2,
            'shlok':
                'मय्यावेश्य मनो ये मां नित्ययुक्ता उपासते ।\nश्रद्धया परयोपेतास्ते मे युक्ततमा मताः ॥१२-२॥',
            'meaning':
                'श्रीभगवान् ने कहा – जो लोगअपने मन को मेरे साकार रूप में एकाग्र करते हैं, और अत्यन्त श्रद्धापूर्वकमेरी पूजा करने में सदैव लगे रहते हैं, वे मेरे द्वारा परम सिद्ध मानेजाते हैं ।',
          },
          {
            'no': 3,
            'shlok':
                'ये त्वक्षरमनिर्देश्यमव्यक्तं पर्युपासते ।\nसर्वत्रगमचिन्त्यं च कूटस्थमचलं ध्रुवम् ॥१२-३॥\nसंनियम्येन्द्रियग्रामं सर्वत्र समबुद्धयः ।\nते प्राप्नुवन्ति मामेव सर्वभूतहिते रताः ॥१२-४॥\nक्लेशोऽधिकतरस्तेषामव्यक्तासक्तचेतसाम् ।\nअव्यक्ता हि गतिर्दुःखं देहवद्भिरवाप्यते ॥१२-५॥',
            'meaning':
                'लेकिन जो लोग अपनी इन्द्रियों को वशमें करके तथा सबों के प्रति समभाव रखकर परम सत्य की निराकार कल्पना केअन्तर्गत उस अव्यक्त की पूरी तरह से पूजा करते हैं, जो इन्द्रियों कीअनुभूति के परे है, सर्वव्यापी है, अकल्पनीय है, अपरिवर्तनीय है, अचल तथाध्रुव है, वे समस्त लोगों के कल्याण में संलग्न रहकर अन्ततः मुझे प्राप्तकरते है, जिनलोगों के मन परमेश्र्वर के अव्यक्त, निराकार स्वरूप के प्रति आसक्त हैं, उनके लिए प्रगति कर पाना अत्यन्त कष्टप्रद है | देहधारियों के लिए उसक्षेत्र में प्रगति कर पाना सदैव दुष्कर होता है ।',
          },
          {
            'no': 4,
            'shlok':
                'ये तु सर्वाणि कर्माणि मयि संन्यस्य मत्पराः ।\nअनन्येनैव योगेन मां ध्यायन्त उपासते ॥१२-६॥\nतेषामहं समुद्धर्ता मृत्युसंसारसागरात् ।\nभवामि नचिरात्पार्थ मय्यावेशितचेतसाम् ॥१२-७॥',
            'meaning':
                'जो अपने सारे कार्यों को मुझमें अर्पित करकेतथा अविचलित भाव से मेरी भक्ति करते हुए मेरी पूजा करते हैं और अपनेचित्तों को मुझ पर स्थिर करके निरन्तर मेरा ध्यान करते हैं, उनके लिए हेपार्थ! मैं जन्म-मृत्यु के सागर से शीघ्र उद्धार करने वाला हूँ ।',
          },
          {
            'no': 5,
            'shlok':
                'मय्येव मन आधत्स्व मयि बुद्धिं निवेशय ।\nनिवसिष्यसि मय्येव अत ऊर्ध्वं न संशयः ॥१२-८॥',
            'meaning':
                'मुझ भगवान् में अपने चित्त को स्थिर करो और अपनी सारी बुद्धि मुझमें लगाओ । इस प्रकार तुम निस्सन्देह मुझमें सदैव वास करोगे ।',
          },
          {
            'no': 6,
            'shlok':
                'નેअथ चित्तं समाधातुं न शक्नोषि मयि स्थिरम् ।\nअभ्यासयोगेन ततो मामिच्छाप्तुं धनंजय ॥१२-९॥',
            'meaning':
                'हे अर्जुन, हे धनञ्जय! यदि तुम अपने चित्त को अविचल भाव से मुझ पर स्थिर नहीं कर सकते, तो तुम भक्तियोग के विधि-विधानों का पालन करो । इस प्रकार तुम मुझे प्राप्त करने की चाह उत्पन्न करो ।',
          },
          {
            'no': 7,
            'shlok':
                'अभ्यासेऽप्यसमर्थोऽसि मत्कर्मपरमो भव ।\nमदर्थमपि कर्माणि कुर्वन्सिद्धिमवाप्स्यसि ॥१२-१०॥',
            'meaning':
                'यदि तुम भक्तियोग के विधि-विधानों का भी अभ्यास नहीं कर सकते, तो मेरे लिए कर्म करने का प्रयत्न करो, क्योंकि मेरे लिए कर्म करने से तुम पूर्ण अवस्था (सिद्धि) को प्राप्त होगे ।',
          },
          {
            'no': 8,
            'shlok':
                'अथैतदप्यशक्तोऽसि कर्तुं मद्योगमाश्रितः ।\nसर्वकर्मफलत्यागं ततः कुरु यतात्मवान् ॥१२-११॥',
            'meaning':
                'किन्तु यदि तुम मेरे इस भावनामृत में कर्म करने में असमर्थ हो तो तुम अपने कर्म के समस्त फलों को त्याग कर कर्म करने का तथा आत्म-स्थित होने का प्रयत्न करो ।',
          },
          {
            'no': 9,
            'shlok':
                'श्रेयो हि ज्ञानमभ्यासाज्ज्ञानाद्ध्यानं विशिष्यते ।\nध्यानात्कर्मफलत्यागस्त्यागाच्छान्तिरनन्तरम् ॥१२-१२॥',
            'meaning':
                'यदि तुम यह अभ्यास नहीं कर सकते, तो ज्ञान के अनुशीलन में लग जाओ । लेकिन ज्ञान से श्रेष्ठ ध्यान है और ध्यान से भी श्रेष्ठ कर्म फलों का परित्याग क्योंकि ऐसे त्याग से मनुष्य को मनःशान्ति प्राप्त हो सकती है ।',
          },
          {
            'no': 10,
            'shlok':
                'अद्वेष्टा सर्वभूतानां मैत्रः करुण एव च ।\nनिर्ममो निरहंकारः समदुःखसुखः क्षमी ॥१२-१३॥',
            'meaning':
                'भूतमात्र के प्रति जो द्वेषरहित है तथा सबका मित्र तथा करुणावान् है; जो ममता और अहंकार से रहित, सुख और दु:ख में सम और क्षमावान् है ।',
          },
          {
            'no': 11,
            'shlok':
                'संतुष्टः सततं योगी यतात्मा दृढनिश्चयः ।\nमय्यर्पितमनोबुद्धिर्यो मद्भक्तः स मे प्रियः ॥१२-१४॥',
            'meaning':
                'जो संयतात्मा, दृढ़निश्चयी योगी सदा सन्तुष्ट है, जो अपने मन और बुद्धि को मुझमें अर्पण किये हुए है, जो ऐसा मेरा भक्त है, वह मुझे प्रिय है ।',
          },
          {
            'no': 12,
            'shlok':
                'यस्मान्नोद्विजते लोको लोकान्नोद्विजते च यः ।\nहर्षामर्षभयोद्वेगैर्मुक्तो यः स च मे प्रियः ॥१२-१५॥',
            'meaning':
                'जिससे किसी को कष्ट नहीं पहुँचता तथा जो अन्य किसी के द्वारा विचलित नहीं किया जाता, जो सुख-दुख में, भय तथा चिन्ता में समभाव रहता है, वह मुझे अत्यन्त प्रिय है ।',
          },
          {
            'no': 13,
            'shlok':
                'अनपेक्षः शुचिर्दक्ष उदासीनो गतव्यथः ।\nसर्वारम्भपरित्यागी यो मद्भक्तः स मे प्रियः ॥१२-१६॥',
            'meaning':
                'मेरा ऐसा भक्त जो सामान्य कार्य-कलापों पर आश्रित नहीं है, जो शुद्ध है, दक्ष है, चिन्तारहित है, समस्त कष्टों से रहित है और किसी फल के लिए प्रयत्नशील नहीं रहता, मुझे अतिशय प्रिय है ।',
          },
          {
            'no': 14,
            'shlok':
                'यो न हृष्यति न द्वेष्टि न शोचति न काङ्क्षति ।\nशुभाशुभपरित्यागी भक्तिमान्यः स मे प्रियः ॥१२-१७॥',
            'meaning':
                'जो न कभी हर्षित होता है, न शोक करता है, जो न पछताता है, न इच्छा करता है, तथा शुभ तथा अशुभ दोनों प्रकार की वस्तुओं का परित्याग कर देता है, ऐसा भक्त मुझे अत्यन्त प्रिय है ।',
          },
          {
            'no': 15,
            'shlok':
                'समः शत्रौ च मित्रे च तथा मानापमानयोः ।\nशीतोष्णसुखदुःखेषु समः सङ्गविवर्जितः ॥१२-१८॥\nतुल्यनिन्दास्तुतिर्मौनी सन्तुष्टो येन केनचित् ।\nअनिकेतः स्थिरमतिर्भक्तिमान्मे प्रियो नरः ॥१२-१९॥',
            'meaning':
                'जो मित्रों तथा शत्रुओं के लिए समान है, जो मान तथा अपमान, शीत तथा गर्मी, सुख तथा दुख, यश तथा अपयश में समभाव रखता है, जो दूषित संगति से सदैव मुक्त रहता है, जो सदैव मौन और किसी भी वस्तु से संतुष्ट रहता है, जो किसी प्रकार के घर-बार की परवाह नहीं करता, जो ज्ञान में दृढ़ है और जो भक्ति में संलग्न है – ऐसा पुरुष मुझे अत्यन्त प्रिय है ।',
          },
          {
            'no': 16,
            'shlok':
                'ये तु धर्म्यामृतमिदं यथोक्तं पर्युपासते ।\nश्रद्दधाना मत्परमा भक्तास्तेऽतीव मे प्रियाः ॥१२-२०॥',
            'meaning':
                'जो इस भक्ति के अमर पथ का अनुसरण करते हैं, और जो मुझे ही अपने चरम लक्ष्य बना कर श्रद्धासहित पूर्णरूपेण संलग्न रहते हैं, वे भक्त मुझे अत्यधिक प्रिय हैं ।',
          },
        ],
      },
      //chapter 13
      {
        'id': 'तेरहवाँ अध्याय',
        'name': 'क्षेत्रक्षत्रज्ञविभागयोग',
        'shloks': [
          {
            'shlok': '',
            'meaning': '',
          },
        ],
      },
      //chapter 14
      {
        'id': 'चौदहवाँ अध्याय',
        'name': 'गुणत्रयविभागयोग',
        'shloks': [
          {
            'shlok': '',
            'meaning': '',
          },
        ],
      },
      //chapter 15
      {
        'id': 'पंद्रहवाँ अध्याय',
        'name': 'पुरुषोत्तमयोग',
        'shloks': [
          {
            'no': 1,
            'shlok':
                'ऊर्ध्वमूलमधःशाखमश्वत्थं प्राहुरव्ययम् ।\nछन्दांसि यस्य पर्णानि यस्तं वेद स वेदवित् ॥१५-१॥',
            'meaning':
                'भगवान् ने कहा – कहा जाता है कि एक शाश्र्वत अश्र्वत्थ वृक्ष है, जिसकी जड़े तो ऊपर की ओर हैं और शाखाएँ नीचे की ओर तथा पत्तियाँ वैदिक स्तोत्र हैं । जो इस वृक्ष को जानता है, वह वेदों का ज्ञाता है ।',
          },
          {
            'no': 2,
            'shlok':
                'अधश्चोर्ध्वं प्रसृतास्तस्य शाखा गुणप्रवृद्धा विषयप्रवालाः ।\nअधश्च मूलान्यनुसंततानि कर्मानुबन्धीनि मनुष्यलोके ॥',
            'meaning':
                'इस वृक्ष की शाखाएँ ऊपर तथा नीचे फैली हुई हैं और प्रकृति के तीन गुणों द्वारा पोषित हैं । इसकी टहनियाँ इन्द्रियविषय हैं । इस वृक्ष की जड़ें नीचे की ओर भी जाती हैं, जो मानवसमाज के सकाम कर्मों से बँधी हुई हैं ।',
          },
          {
            'no': 3,
            'shlok':
                'न रूपमस्येह तथोपलभ्यते नान्तो न चादिर्न च संप्रतिष्ठा ।\nअश्वत्थमेनं सुविरूढमूलमसङ्गशस्त्रेण दृढेन छित्त्वा ॥',
            'meaning':
                'इस (संसार वृक्ष) का स्वरूप जैसा कहा गया है वैसा यहाँ उपलब्ध नहीं होता है, क्योंकि इसका न आदि है और न अंत और न प्रतिष्ठा ही है। इस अति दृढ़ मूल वाले अश्वत्थ वृक्ष को दृढ़ असङ्ग शस्त्र से काटकर ।',
          },
          {
            'no': 4,
            'shlok':
                'ततः पदं तत्परिमार्गितव्यं यस्मिन्गता न निवर्तन्ति भूयः ।\nतमेव चाद्यं पुरुषं प्रपद्ये यतः प्रवृत्तिः प्रसृता पुराणी ॥१५-४॥',
            'meaning':
                '(तदुपरान्त) उस पद का अन्वेषण करना चाहिए जिसको प्राप्त हुए पुरुष पुन: संसार में नहीं लौटते हैं। मैं उस आदि पुरुष की शरण हूँ, जिससे यह पुरातन प्रवृत्ति प्रसृत हुई है ।',
          },
          {
            'no': 5,
            'shlok':
                'निर्मानमोहा जितसङ्गदोषा अध्यात्मनित्या विनिवृत्तकामाः ।\nद्वन्द्वैर्विमुक्ताः सुखदुःखसंज्ञैर्गच्छन्त्यमूढाः पदमव्ययं तत् ॥१५-५॥',
            'meaning':
                'जो झूठी प्रतिष्ठा, मोह तथा कुसंगति से मुक्त हैं, जो शाश्र्वत तत्त्व को समझते हैं, जिन्होंने भौतिक काम को नष्ट कर दिया है, जो सुख तथा दुख के द्वन्द्व से मुक्त हैं और जो मोहरहित होकर परम पुरुष के शरणागत होना चाहते हैं, वे उस शाश्र्वत राज्य को प्राप्त होते हैं ।',
          },
          {
            'no': 6,
            'shlok':
                'न तद्भासयते सूर्यो न शशाङ्को न पावकः ।\nयद्गत्वा न निवर्तन्ते तद्धाम परमं मम ॥१५-६॥',
            'meaning':
                'वह मेरा परम धाम न तो सूर्य या चन्द्र के द्वारा प्रकाशित होता है और न अग्नि या बिजली से । जो लोग वहाँ पहुँच जाते हैं, वे इस भौतिक जगत् में फिर से लौट कर नहीं आते ।',
          },
          {
            'no': 7,
            'shlok':
                'ममैवांशो जीवलोके जीवभूतः सनातनः ।\nमनःषष्ठानीन्द्रियाणि प्रकृतिस्थानि कर्षति ॥१५-७॥',
            'meaning':
                'इस बद्ध जगत् में सारे जीव मेरे शाश्र्वत अंश हैं । बद्ध जीवन के कारण वे छहों इन्द्रियों के घोर संघर्ष कर रहे हैं, जिसमें मन भी सम्मिलित है ।',
          },
          {
            'no': 8,
            'shlok':
                'शरीरं यदवाप्नोति यच्चाप्युत्क्रामतीश्वरः ।\nगृहित्वैतानि संयाति वायुर्गन्धानिवाशयात् ॥१५-८॥',
            'meaning':
                'इस संसार में जीव अपनी देहात्मबुद्धि को एक शरीर से दूसरे में उसी तरह ले जाता है, जिस प्रकार वायु सुगन्धि को ले जाता है । इस प्रकार वह एक शरीर धारण करता है और फिर इसे त्याग कर दूसरा शरीर धारण करता है ।',
          },
          {
            'no': 9,
            'shlok':
                'श्रोत्रं चक्षुः स्पर्शनं च रसनं घ्राणमेव च ।\nअधिष्ठाय मनश्चायं विषयानुपसेवते ॥१५-९॥',
            'meaning':
                'इस प्रकार दूसरा स्थूल शरीर धारण करके जीव विशेष प्रकार का कान, आँख, जीभ, नाक तथा स्पर्श इन्द्रिय (त्वचा) प्राप्त करता है, जो मन के चारों ओर संपुंजित है | इस प्रकार वह इन्द्रियविषयों के एक विशिष्ट समुच्चय का भोग करता है ।',
          },
          {
            'no': 10,
            'shlok':
                'उत्क्रामन्तं स्थितं वापि भुञ्जानं वा गुणान्वितम् ।\nविमूढा नानुपश्यन्ति पश्यन्ति ज्ञानचक्षुषः ॥१५-१०॥',
            'meaning':
                'मूर्ख न तो समझ पाते हैं कि जीव किस प्रकार अपना शरीर त्याग सकता है, न ही वे यह समझ पाते हैं कि प्रकृति के गुणों के अधीन वह किस तरह के शरीर का भोग करता है । लेकिन जिसकी आँखें ज्ञान से प्रशिक्षित होती हैं, वह यह सब देख सकता है ।',
          },
          {
            'no': 11,
            'shlok':
                'यतन्तो योगिनश्चैनं पश्यन्त्यात्मन्यवस्थितम् ।\nयतन्तोऽप्यकृ तात्मानो नैनं पश्यन्त्यचेतसः ॥१५-११॥',
            'meaning':
                'आत्म-साक्षात्कार को प्राप्त प्रयत्नशील योगीजन यह स्पष्ट रूप से देख सकते हैं । लेकिन जिनके मन विकसित नहीं हैं और जो आत्म-साक्षात्कार को प्राप्त नहीं हैं, वे प्रयत्न करके भी यह नहीं देख पाते कि क्या हो रहा है ।',
          },
          {
            'no': 12,
            'shlok':
                'यदादित्यगतं तेजो जगद्भासयतेऽखिलम् ।\nयच्चन्द्रमसि यच्चाग्नौ तत्तेजो विद्धि मामकम् ॥१५-१२॥',
            'meaning':
                'सूर्य का तेज, जो सारे विश्र्व के अंधकार को दूर करता है, मुझसे ही निकलता है | चन्द्रमा तथा अग्नि के तेज भी मुझसे उत्पन्न हैं ।',
          },
          {
            'no': 13,
            'shlok':
                'गामाविश्य च भूतानि धारयाम्यहमोजसा ।\nपुष्णामि चौषधीः सर्वाः सोमो भूत्वा रसात्मकः ॥१५-१३॥',
            'meaning':
                'मैं प्रत्येक लोक में प्रवेश करता हूँ और मेरी शक्ति से सारे लोक अपनी कक्षा में स्थित रहते हैं । मैं चन्द्रमा बनकर समस्त वनस्पतियों को जीवन-रस प्रदान करता हूँ ।',
          },
          {
            'no': 14,
            'shlok':
                'अहं वैश्वानरो भूत्वा प्राणिनां देहमाश्रितः ।\nप्राणापानसमायुक्तः पचाम्यन्नं चतुर्विधम् ॥१५-१४॥',
            'meaning':
                'मैं समस्त जीवों के शरीरों में पाचन-अग्नि (वैश्र्वानर) हूँ और मैं श्र्वास-प्रश्र्वास (प्राण वायु) में रह कर चार प्रकार के अन्नों को पचाता हूँ ।',
          },
          {
            'no': 15,
            'shlok':
                'सर्वस्य चाहं हृदि संनिविष्टो मत्तः स्मृतिर्ज्ञानमपोहनं च ।\nवेदैश्च सर्वैरहमेव वेद्यो वेदान्तकृद्वेदविदेव चाहम् ॥१५-१५॥',
            'meaning':
                'मैं प्रत्येक जीव के हृदय में आसीन हूँ और मुझ से ही स्मृति, ज्ञान तथा विस्मृति होती है | मैं ही वेदों के द्वारा जानने योग्य हूँ | निस्सन्देह मैं वेदान्त का संकलनकर्ता तथा समस्त वेदों का जानने वाला हूँ ।',
          },
          {
            'no': 16,
            'shlok':
                'द्वाविमौ पुरुषौ लोके क्षरश्चाक्षर एव च ।\nक्षरः सर्वाणि भूतानि कूटस्थोऽक्षर उच्यते ॥१५-१६॥',
            'meaning':
                'जीव दो प्रकार हैं – च्युत तथा अच्युत । भौतिक जगत् में प्रत्येक जीव च्युत (क्षर) होता है और आध्यात्मिक जगत् में प्रत्येक जीव अच्युत कहलाता है ।',
          },
          {
            'no': 17,
            'shlok':
                'उत्तमः पुरुषस्त्वन्यः परमात्मेत्युदाहृतः ।\nयो लोकत्रयमाविश्य बिभर्त्यव्यय ईश्वरः ॥१५-१७॥',
            'meaning':
                'इन दोनों के अतिरिक्त एक परम पुरुष परमात्मा है जो साक्षात् अविनाशी है और जो तीनों लोकों में प्रवेश करके उनका पालन कर रहा है ।',
          },
          {
            'no': 18,
            'shlok':
                'यस्मात्क्षरमतीतोऽहमक्षरादपि चोत्तमः ।\nअतोऽस्मि लोके वेदे च प्रथितः पुरुषोत्तमः ॥१५-१८॥',
            'meaning':
                'चूँकि मैं क्षर तथा अक्षर दोनों के परे हूँ और चूँकि मैं सर्वश्रेष्ठ हूँ, अतएव मैं इस जगत् में तथा वेदों में परम पुरुष के रूप में विख्यात हूँ ।',
          },
          {
            'no': 19,
            'shlok':
                'यो मामेवमसंमूढो जानाति पुरुषोत्तमम् ।\nस सर्वविद्भजति मां सर्वभावेन भारत ॥१५-१९॥',
            'meaning':
                'जो कोई भी मुझे संशयरहित होकर पुरुषोत्तम भगवान् के रूप में जानता है, वह सब कुछ जानता है । अतएव हे भरतपुत्र! वह व्यक्ति मेरी पूर्ण भक्ति में रत होता है ।',
          },
          {
            'no': 20,
            'shlok':
                'इति गुह्यतमं शास्त्रमिदमुक्तं मयानघ ।\nएतद्‌बुद्ध्वा बुद्धिमान्स्यात्कृतकृत्यश्च भारत ॥१५-२०॥',
            'meaning':
                'हे अनघ! यह वैदिक शास्त्रों का सर्वाधिक गुप्त अंश है, जिसे मैंने अब प्रकट किया है | जो कोई इसे समझता है, वह बुद्धिमान हो जाएगा और उसके प्रयास पूर्ण होंगे ।',
          },
        ],
      },
      //chapter 16
      {
        'id': 'सोलहवाँ अध्याय',
        'name': 'दैवासुरसंपद्विभागयोग',
        'shloks': [
          {
            'no': 1,
            'shlok':
                'अभयं सत्त्वसंशुद्धिर्ज्ञानयोगव्यवस्थितिः ।\nदानं दमश्च यज्ञश्च स्वाध्यायस्तप आर्जवम् ॥१६-१॥',
            'meaning':
                'श्री भगवान् ने कहा - अभय, अन्त:करण की शुद्धि, ज्ञानयोग में दृढ़ स्थिति, दान, दम, यज्ञ, स्वाध्याय, तप और आर्जव ।',
          },
          {
            'no': 2,
            'shlok':
                'अहिंसा सत्यमक्रोधस्त्यागः शान्तिरपैशुनम् ।\nदया भूतेष्वलोलुप्त्वं मार्दवं ह्रीरचापलम् ॥१६-२॥',
            'meaning':
                'अहिंसा, सत्य, क्रोध का अभाव, त्याग, शान्ति, अपैशुनम् (किसी की निन्दा न करना), भूतमात्र के प्रति दया, अलोलुपता , मार्दव (कोमलता), लज्जा, अचंचलता ।',
          },
          {
            'no': 3,
            'shlok':
                'तेजः क्षमा धृतिः शौचमद्रोहो नातिमानिता ।\nभवन्ति संपदं दैवीमभिजातस्य भारत ॥१६-३॥',
            'meaning':
                'हे भारत ! तेज, क्षमा, धैर्य, शौच (शुद्धि), अद्रोह और अतिमान (गर्व) का अभाव ये सब दैवी संपदा को प्राप्त पुरुष के लक्षण हैं ।',
          },
          {
            'no': 4,
            'shlok':
                'दम्भो दर्पोऽभिमानश्च क्रोधः पारुष्यमेव च ।\nअज्ञानं चाभिजातस्य पार्थ संपदमासुरीम् ॥१६-४॥',
            'meaning':
                'हे पृथापुत्र! दम्भ, दर्प, अभिमान, क्रोध, कठोरता तथा अज्ञान – ये सारे आसुरी स्वभाव वालों के गुण हैं ।',
          },
          {
            'no': 5,
            'shlok':
                'दैवी संपद्विमोक्षाय निबन्धायासुरी मता ।\nमा शुचः संपदं दैवीमभिजातोऽसि पाण्डव ॥१६-५॥',
            'meaning':
                'दिव्य गुण मोक्ष के लिए अनुकूल हैं और आसुरी गुण बन्धन दिलाने के लिए हैं । हे पाण्डुपुत्र! तुम चिन्ता मत करो, क्योंकि तुम दैवी गुणों से युक्त होकर जन्मे हो ।',
          },
          {
            'no': 6,
            'shlok':
                'द्वौ भूतसर्गौ लोकेऽस्मिन्दैव आसुर एव च ।\nदैवो विस्तरशः प्रोक्त आसुरं पार्थ मे शृणु ॥१६-६॥',
            'meaning':
                'हे पृथापुत्र! इस संसार में सृजित प्राणी दो प्रकार के हैं – दैवी तथा आसुरी । मैं पहले ही विस्तार से तुम्हें दैवी गुण बतला चुका हूँ । अब मुझसे आसुरी गुणों के विषय में सुनो ।',
          },
          {
            'no': 7,
            'shlok':
                'प्रवृत्तिं च निवृत्तिं च जना न विदुरासुराः ।\nन शौचं नापि चाचारो न सत्यं तेषु विद्यते ॥१६-७॥',
            'meaning':
                'जो आसुरी हैं , वे यह नहीं जानते कि क्या करना चाहिए और क्या नहीं करना चाहिए । उनमें न तो पवित्रता, न उचित आचरण और न ही सत्य पाया जाता है',
          },
          {
            'no': 8,
            'shlok':
                'असत्यमप्रतिष्ठं ते जगदाहुरनीश्वरम् ।\nअपरस्परसंभूतं किमन्यत्कामहैतुकम् ॥१६-८॥',
            'meaning':
                'वे कहते हैं कि यह जगत् मिथ्या है, इसका कोई आधार नहीं है और इसका नियमन किसी ईश्र्वर द्वारा नहीं होता । उनका कहना है कि यह कामेच्छा से उत्पन्न होता है और काम के अतिरिक्त कोई अन्य कारण नहीं है ।',
          },
          {
            'no': 9,
            'shlok':
                'एतां दृष्टिमवष्टभ्य नष्टात्मानोऽल्पबुद्धयः ।\nप्रभवन्त्युग्रकर्माणः क्षयाय जगतोऽहिताः ॥१६-९॥',
            'meaning':
                'ऐसे निष्कर्मों का अनुगमन करते हुए आसुरी लोग, जिन्होंने आत्म-ज्ञान खो दिया है और जो बुद्धिहीन हैं, ऐसे अनुपयोगी एवं भयावह कार्यों में प्रवृत्त होते हैं जो संसार का विनाश करने के लिए होता है ।',
          },
          {
            'no': 10,
            'shlok':
                'काममाश्रित्य दुष्पूरं दम्भमानमदान्विताः ।\nमोहाद्‌गृहीत्वासद्ग्राहान्प्रवर्तन्तेऽशुचिव्रताः ॥१६-१०॥',
            'meaning':
                'कभी न संतुष्ट होने वाले काम का आश्रय लेकर तथा गर्व के मद एवं मिथ्या प्रतिष्ठा में डूबे हुए आसुरी लोग इस तरह मोहग्रस्त होकर सदैव क्षणभंगुर वस्तुओं के द्वारा अपवित्र कर्म का व्रत लिए रहते हैं ।',
          },
          {
            'no': 11,
            'shlok':
                'चिन्तामपरिमेयां च प्रलयान्तामुपाश्रिताः ।\nकामोपभोगपरमा एतावदिति निश्चिताः ॥१६-११॥',
            'meaning':
                'मरणपर्यन्त रहने वाली अपरिमित चिन्ताओं से ग्रस्त और विषयोपभोग को ही परम लक्ष्य मानने वाले ये आसुरी लोग इस निश्चित मत के होते हैं कि इतना ही (सत्य, आनन्द) है ।',
          },
          {
            'no': 12,
            'shlok':
                'आशापाशशतैर्बद्धाः कामक्रोधपरायणाः ।\nईहन्ते कामभोगार्थमन्यायेनार्थसञ्चयान् ॥१६-१२॥',
            'meaning':
                'सैकड़ों आशापाशों से बन्धे हुये, काम और क्रोध के वश में ये लोग विषयभोगों की पूर्ति के लिये अन्यायपूर्वक धन का संग्रह करने के लिये चेष्टा करते हैं ।',
          },
          {
            'no': 13,
            'shlok':
                'इदमद्य मया लब्धमिमं प्राप्स्ये मनोरथम् ।\nइदमस्तीदमपि मे भविष्यति पुनर्धनम् ॥१६-१३॥',
            'meaning':
                'मैंने आज यह पाया है और इस मनोरथ को भी प्राप्त करूंगा, मेरे पास यह इतना धन है और इससे भी अधिक धन भविष्य में होगा ।',
          },
          {
            'no': 14,
            'shlok':
                'असौ मया हतः शत्रुर्हनिष्ये चापरानपि ।\nईश्वरोऽहमहं भोगी सिद्धोऽहं बलवान्सुखी ॥१६-१४॥',
            'meaning':
                'यह शत्रु मेरे द्वारा मारा गया है और दूसरे शत्रुओं को भी मैं मारूंगा, मैं ईश्वर हूँ और भोगी हूँ, मैं सिद्ध पुरुष हूँ, मैं बलवान और सुखी हूँ ।',
          },
          {
            'no': 15,
            'shlok':
                'आढ्योऽभिजनवानस्मि कोऽन्योऽस्ति सदृशो मया ।\nयक्ष्ये दास्यामि मोदिष्य इत्यज्ञानविमोहिताः ॥१६-१५॥',
            'meaning':
                'मैं धनवान् और श्रेष्ठकुल में जन्मा हूँ। मेरे समान दूसरा कौन है?, मैं यज्ञ करूंगा, मैं दान दूँगा, मैं मौज करूँगा - इस प्रकार के अज्ञान से वे मोहित होते हैं ।',
          },
          {
            'no': 16,
            'shlok':
                'अनेकचित्तविभ्रान्ता मोहजालसमावृताः ।\nप्रसक्ताः कामभोगेषु पतन्ति नरकेऽशुचौ ॥१६-१६॥',
            'meaning':
                'इस प्रकार अनेक चिन्ताओं से उद्विग्न होकर तथा मोहजाल में बँधकर वे इन्द्रियभोग में अत्यधिक आसक्त हो जाते हैं और नरक में गिरते हैं ।',
          },
          {
            'no': 17,
            'shlok':
                'आत्मसंभाविताः स्तब्धा धनमानमदान्विताः ।\nयजन्ते नामयज्ञैस्ते दम्भेनाविधिपूर्वकम् ॥१६-१७॥',
            'meaning':
                'अपने को श्रेष्ठ मानने वाले तथा सदैव घमंड करने वाले, सम्पत्ति तथा मिथ्या प्रतिष्ठा से मोहग्रस्त लोग किसी विधि-विधान का पालन न करते हुए कभी-कभी नाम मात्र के लिए बड़े ही गर्व के साथ यज्ञ करते हैं ।',
          },
          {
            'no': 18,
            'shlok':
                'अहंकारं बलं दर्पं कामं क्रोधं च संश्रिताः ।\nमामात्मपरदेहेषु प्रद्विषन्तोऽभ्यसूयकाः ॥१६-१८॥',
            'meaning':
                'मिथ्या अहंकार, बल, दर्प, काम तथा क्रोध से मोहित होकर आसुरी व्यक्ति अपने शरीर में तथा अन्यों के शरीर में स्थित भगवान् से ईर्ष्या और वास्तविक धर्म की निन्दा करने लगते हैं ।',
          },
          {
            'no': 19,
            'shlok':
                'तानहं द्विषतः क्रुरान्संसारेषु नराधमान् ।\nक्षिपाम्यजस्रमशुभानासुरीष्वेव योनिषु ॥१६-१९॥',
            'meaning':
                'जो लोग ईर्ष्यालु तथा क्रूर हैं और नराधम हैं, उन्हें मैं निरन्तर विभिन्न आसुरी योनियों में, भवसागर में डालता रहता हूँ ।',
          },
          {
            'no': 20,
            'shlok':
                'आसुरीं योनिमापन्ना मूढा जन्मनि जन्मनि ।\nमामप्राप्यैव कौन्तेय ततो यान्त्यधमां गतिम् ॥१६-२०॥',
            'meaning':
                'हे कुन्तीपुत्र! ऐसे व्यक्ति आसुरी योनि में बारम्बार जन्म ग्रहण करते हुए कभी भी मुझ तक पहुँच नहीं पाते । वे धीरे-धीरे अत्यन्त अधम गति को प्राप्त होते हैं ।',
          },
          {
            'no': 21,
            'shlok':
                'त्रिविधं नरकस्येदं द्वारं नाशनमात्मनः ।\nकामः क्रोधस्तथा लोभस्तस्मादेतत्त्रयं त्यजेत् ॥१६-२१॥',
            'meaning':
                'इस नरक के तीन द्वार हैं – काम, क्रोध और लोभ । प्रत्येक बुद्धिमान व्यक्ति को चाहिए कि इन्हें त्याग दे, क्योंकि इनसे आत्मा का पतन होता है ।',
          },
          {
            'no': 22,
            'shlok':
                'एतैर्विमुक्तः कौन्तेय तमोद्वारैस्त्रिभिर्नरः ।\nआचरत्यात्मनः श्रेयस्ततो याति परां गतिम् ॥१६-२२॥',
            'meaning':
                'हे कुन्तीपुत्र! जो व्यक्ति इन तीनों नरक-द्वारों से बच पाता है, वह आत्म-साक्षात्कार के लिए कल्याणकारी कार्य करता है और इस प्रकार क्रमशः परम गति को प्राप्त होता है ।',
          },
          {
            'no': 23,
            'shlok':
                'यः शास्त्रविधिमुत्सृज्य वर्तते कामकारतः ।\nन स सिद्धिमवाप्नोति न सुखं न परां गतिम् ॥१६-२३॥',
            'meaning':
                'जो शास्त्रों के आदेशों की अवहेलना करता है और मनमाने ढंग से कार्य करता है, उसे न तो सिद्धि, न सुख, न ही परमगति की प्राप्ति हो पाती है ।',
          },
          {
            'no': 24,
            'shlok':
                'तस्माच्छास्त्रं प्रमाणं ते कार्याकार्यव्यवस्थितौ ।\nज्ञात्वा शास्त्रविधानोक्तं कर्म कर्तुमिहार्हसि ॥१६-२४॥',
            'meaning':
                'अतएव मनुष्य को यह जानना चाहिए कि शास्त्रों के विधान के अनुसार क्या कर्तव्य है और क्या अकर्तव्य है । उसे विधि-विधानों को जानकर कर्म करना चाहिए जिससे वह क्रमशः ऊपर उठ सके ।',
          },
        ],
      },
      //chapter 17
      {
        'id': 'सत्रहवाँ अध्याय',
        'name': 'श्रद्धात्रयविभागयोग',
        'shloks': [
          {
            'no': 1,
            'shlok':
                'ये शास्त्रविधिमुत्सृज्य यजन्ते श्रद्धयान्विताः ।\nतेषां निष्ठा तु का कृष्ण सत्त्वमाहो रजस्तमः ॥१७-१॥',
            'meaning':
                'अर्जुन ने कहा – हे कृष्ण! जो लोग शास्त्र के नियमों का पालन न करके अपनी कल्पना के अनुसार पूजा करते हैं, उनकी स्थिति कौन सी है? वे सतोगुणी हैं, रजोगुणी हैं या तमोगुणी?',
          },
          {
            'no': 2,
            'shlok':
                'त्रिविधा भवति श्रद्धा देहिनां सा स्वभावजा ।\nसात्त्विकी राजसी चैव तामसी चेति तां शृणु ॥१७-२॥',
            'meaning':
                'भगवान् ने कहा – देहधारी जीव द्वारा अर्जित गुणों के अनुसार उसकी श्रद्धा तीन प्रकार की हो सकती है – सतोगुणी, रजोगुणी अथवा तमोगुणी । अब इसके विषय में मुझसे सुनों ।',
          },
          {
            'no': 3,
            'shlok':
                'सत्त्वानुरूपा सर्वस्य श्रद्धा भवति भारत ।\nश्रद्धामयोऽयं पुरुषो यो यच्छ्रद्धः स एव सः ॥१७-३॥',
            'meaning':
                'हे भरतपुत्र! विभिन्न गुणों के अन्तर्गत अपने अपने अस्तित्व के अनुसार मनुष्य एक विशेष प्रकार की श्रद्धा विकसित करता है । अपने द्वारा अर्जित गुणों के अनुसार ही जीव को विशेष श्रद्धा से युक्त कहा जाता है ।',
          },
          {
            'no': 4,
            'shlok':
                'यजन्ते सात्त्विका देवान्यक्षरक्षांसि राजसाः ।\nप्रेतान्भूतगणांश्चान्ये यजन्ते तामसा जनाः ॥१७-४॥',
            'meaning':
                'सतोगुणी व्यक्ति देवताओं को पूजते हैं, रजोगुणी यक्षों व राक्षसों की पूजा करते हैं और तमो गुणी व्यक्ति भूत-प्रेतों को पूजते हैं ।',
          },
          {
            'no': 5,
            'shlok':
                'अशास्त्रविहितं घोरं तप्यन्ते ये तपो जनाः ।\nदम्भाहंकारसंयुक्ताः कामरागबलान्विताः ॥१७-५॥',
            'meaning':
                'जो लोग शास्त्रविधि से रहित घोर तप करते हैं तथा दम्भ, अहंकार, काम और राग से भी युक्त होते हैं ।',
          },
          {
            'no': 6,
            'shlok':
                'कर्षयन्तः शरीरस्थं भूतग्राममचेतसः ।\nमां चैवान्तःशरीरस्थं तान्विद्ध्यासुरनिश्चयान् ॥१७-६॥',
            'meaning':
                'और शरीरस्थ भूतसमुदाय को तथा मुझ अन्तर्यामी को भी कृश करने वाले अर्थात् कष्ट पहुँचाने वाले जो अविवेकी लोग हैं, उन्हें तुम आसुरी निश्चय वाले जानो ।',
          },
          {
            'no': 7,
            'shlok':
                'आहारस्त्वपि सर्वस्य त्रिविधो भवति प्रियः ।\nयज्ञस्तपस्तथा दानं तेषां भेदमिमं शृणु ॥१७-७॥',
            'meaning':
                'यहाँ तक कि प्रत्येक व्यक्ति जो भोजन पसन्द करता है, वह भी प्रकृति के अनुसार तीन प्रकार का होता है । यही बात यज्ञ, तपस्या तथा दान के लिए भी सत्य है । अब उनके भेदों के विषय में सुनो ।',
          },
          {
            'no': 8,
            'shlok':
                'आयुःसत्त्वबलारोग्य सुखप्रीतिविवर्धनाः ।\nरस्याः स्निग्धाः स्थिरा हृद्या आहाराः सात्त्विकप्रियाः ॥१७-८॥',
            'meaning':
                'जो भोजन सात्त्विक व्यक्तियों को प्रिय होता है, वह आयु बढ़ाने वाला, जीवन को शुद्ध करने वाला तथा बल, स्वास्थ्य, सुख तथा तृप्ति प्रदान करने वाला होता है ।ऐसा भोजन रसमय, स्निग्ध, स्वास्थ्यप्रद तथा हृदय को भाने वाला होता है ।',
          },
          {
            'no': 9,
            'shlok':
                'कट्‌वम्ललवणात्युष्ण तीक्ष्णरूक्षविदाहिनः ।\nआहारा राजसस्येष्टा दुःखशोकामयप्रदाः ॥१७-९॥',
            'meaning':
                'अत्यधिक तिक्त, खट्टे, नमकीन, गरम, चटपटे,शुष्क तथा जलन उत्पन्न करने वाले भोजन रजोगुणी व्यक्तियों को प्रिय होते हैं । ऐसे भोजन दुख, शोक तथा रोग उत्पन्न करने वाले हैं ।',
          },
          {
            'no': 10,
            'shlok':
                'यातयामं गतरसं पूति पर्युषितं च यत् ।\nउच्छिष्टमपि चामेध्यं भोजनं तामसप्रियम् ॥१७-१०॥',
            'meaning':
                'खाने से तीन घंटे पूर्व पकाया गया, स्वादहीन, वियोजित एवं सड़ा, जूठा तथा अस्पृश्य वस्तुओं से युक्त भोजन उन लोगों को प्रिय होता है,जो तामसी होते हैं ।',
          },
          {
            'no': 11,
            'shlok':
                'अफलाकाङ्क्षिभिर्यज्ञो विधिदृष्टो य इज्यते ।\nयष्टव्यमेवेति मनः समाधाय स सात्त्विकः ॥१७-११॥',
            'meaning':
                'यज्ञों में वही यज्ञ सात्त्विक होता है,जो शास्त्र के निर्देशानुसार कर्तव्य समझ कर उन लोगों के द्वारा किया जाता है, जो फल की इच्छा नहीं करते ।',
          },
          {
            'no': 12,
            'shlok':
                'अभिसंधाय तु फलं दम्भार्थमपि चैव यत् ।\nइज्यते भरतश्रेष्ठ तं यज्ञं विद्धि राजसम् ॥१७-१२॥',
            'meaning':
                'लेकिन हे भरतश्रेष्ठ! जो यज्ञ किसी भौतिक लाभ के लिए गर्ववश किया जाता है, उसे तुम राजसी जानो ।',
          },
          {
            'no': 13,
            'shlok':
                'विधिहीनमसृष्टान्नं मन्त्रहीनमदक्षिणम् ।\nश्रद्धाविरहितं यज्ञं तामसं परिचक्षते ॥१७-१३॥',
            'meaning':
                'जो यज्ञ शास्त्र के निर्देशों की अवहेलना करके, प्रसाद वितरण किये बिना, वैदिक मन्त्रों का उच्चारण किये बिना, पुरोहितों को दक्षिणा दिये बिना तथा श्रद्धा के बिना सम्पन्न किया जाता है, वह तामसी माना जाता है ।',
          },
          {
            'no': 14,
            'shlok':
                'देवद्विजगुरुप्राज्ञपूजनं शौचमार्जवम् ।\nब्रह्मचर्यमहिंसा च शारीरं तप उच्यते ॥१७-१४॥',
            'meaning':
                'परमेश्र्वर, ब्राह्मणों, गुरु, माता-पिता जैसे गुरुजनों की पूजा करना तथा पवित्रता, सरलता, ब्रह्मचर्य और अहिंसा ही शारीरिक तपस्या है ।',
          },
          {
            'no': 15,
            'shlok':
                'अनुद्वेगकरं वाक्यं सत्यं प्रियहितं च यत् ।\nस्वाध्यायाभ्यसनं चैव वाङ्मयं तप उच्यते ॥१७-१५॥',
            'meaning':
                'सच्चे, भाने वाले,हितकर तथा अन्यों को क्षुब्ध न करने वाले वाक्य बोलना और वैदिक साहित्य का नियमित पारायण करना – यही वाणी की तपस्या है ।',
          },
          {
            'no': 16,
            'shlok':
                'मनः प्रसादः सौम्यत्वं मौनमात्मविनिग्रहः ।\nभावसंशुद्धिरित्येतत्तपो मानसमुच्यते ॥१७-१६॥',
            'meaning':
                'तथा संतोष, सरलता, गम्भीरता, आत्म-संयम एवं जीवन की शुद्धि – ये मन की तपस्याएँ हैं ।',
          },
          {
            'no': 17,
            'shlok':
                'श्रद्धया परया तप्तं तपस्तत्त्रिविधं नरैः ।\nअफलाकाङ्क्षिभिर्युक्तैः सात्त्विकं परिचक्षते ॥१७-१७॥',
            'meaning':
                'भौतिक लाभ की इच्छा न करने वाले तथा केवल परमेश्र्वर में प्रवृत्त मनुष्यों द्वारा दिव्य श्रद्धा से सम्पन्न यह तीन प्रकार की तपस्या सात्त्विक तपस्या कहलाती है ।',
          },
          {
            'no': 18,
            'shlok':
                'सत्कारमानपूजार्थं तपो दम्भेन चैव यत् ।\nक्रियते तदिह प्रोक्तं राजसं चलमध्रुवम् ॥१७-१८॥',
            'meaning':
                'जो तपस्या दंभपूर्वक तथा सम्मान, सत्कार एवं पूजा कराने के लिए सम्पन्न की जाती है, वह राजसी (रजोगुणी) कहलाती है । यह न तो स्थायी होती है न शाश्र्वत ।',
          },
          {
            'no': 19,
            'shlok':
                'मूढग्राहेणात्मनो यत्पीडया क्रियते तपः ।\nपरस्योत्सादनार्थं वा तत्तामसमुदाहृतम् ॥१७-१९॥',
            'meaning':
                'मूर्खतावश आत्म-उत्पीड़न के लिए या अन्यों को विनष्ट करने या हानि पहुँचाने के लिए जो तपस्या की जाती है, वह तामसी कहलाती है ।',
          },
          {
            'no': 20,
            'shlok':
                'दातव्यमिति यद्दानं दीयतेऽनुपकारिणे ।\nदेशे काले च पात्रे च तद्दानं सात्त्विकं स्मृतम् ॥१७-२०॥',
            'meaning':
                'जो दान कर्तव्य समझकर, किसी प्रत्युपकार की आशा के बिना, समुचित काल तथा स्थान में और योग्य व्यक्ति को दिया जाता है, वह सात्त्विक माना जाता है ।',
          },
          {
            'no': 21,
            'shlok':
                'यत्तु प्रत्युपकारार्थं फलमुद्दिश्य वा पुनः ।\nदीयते च परिक्लिष्टं तद्दानं राजसं स्मृतम् ॥१७-२१॥',
            'meaning':
                'किन्तु जो दान प्रत्युपकार की भावना से या कर्म फल की इच्छा से या अनिच्छापूर्वक किया जाता है, वह रजोगुणी (राजस) कहलाता है ।',
          },
          {
            'no': 22,
            'shlok':
                'अदेशकाले यद्दानमपात्रेभ्यश्च दीयते ।\nअसत्कृतमवज्ञातं तत्तामसमुदाहृतम् ॥१७-२२॥',
            'meaning':
                'तथा जो दान किसी अपवित्र स्थान में, अनुचित समय में, किसी अयोग्य व्यक्ति को या बिना समुचित ध्यान तथा आदर से दिया जाता है, वह तामसी कहलाता है ।',
          },
          {
            'no': 23,
            'shlok':
                'ॐ तत्सदिति निर्देशो ब्रह्मणस्त्रिविधः स्मृतः ।\nब्राह्मणास्तेन वेदाश्च यज्ञाश्च विहिताः पुरा ॥१७-२३॥',
            'meaning':
                'सृष्टि के आदिकाल से ऊँ तत् सत् ये तीन शब्द परब्रह्म को सूचित करने के लिए प्रयुक्त किये जाते रहे हैं । ये तीनों सांकेतिक अभिव्यक्तियाँ ब्राह्मणों द्वारा वैदिक मंत्रों का उच्चारण करते समय तथा ब्रह्म को संतुष्ट करने के लिए यज्ञों के समय प्रयुक्त होती थीं ।',
          },
          {
            'no': 24,
            'shlok':
                'तस्मादोमित्युदाहृत्य यज्ञदानतपःक्रियाः ।\nप्रवर्तन्ते विधानोक्ताः सततं ब्रह्मवादिनाम् ॥१७-२४॥',
            'meaning':
                'अतएव योगीजन ब्रह्म की प्राप्ति के लिए शास्त्रीय विधि के अनुसार यज्ञ, दान तथा तप की समस्त क्रियाओं का शुभारम्भ सदैव ओम् से करते हैं ।',
          },
          {
            'no': 25,
            'shlok':
                'तदित्यनभिसन्धाय फलं यज्ञतपःक्रियाः ।\nदानक्रियाश्च विविधाः क्रियन्ते मोक्षकाङ्क्षिभिः ॥१७-२५॥',
            'meaning':
                'मनुष्य को चाहिए कि कर्मफल की इच्छा किये बिना विविध प्रकार के यज्ञ, तप तथा दान को ‘तत्’ शब्द कह कर सम्पन्न करे । ऐसी दिव्य क्रियाओंका उद्देश्य भव-बन्धन से मुक्त होना है ।',
          },
          {
            'no': 26,
            'shlok':
                'सद्भावे साधुभावे च सदित्येतत्प्रयुज्यते ।\nप्रशस्ते कर्मणि तथा सच्छब्दः पार्थ युज्यते ॥१७-२६॥',
            'meaning':
                'हे पार्थ ! सत्य भाव व साधुभाव में सत् शब्द का प्रयोग किया जाता है, और प्रशस्त (श्रेष्ठ, शुभ) कर्म में सत् शब्द प्रयुक्त होता है ।',
          },
          {
            'no': 27,
            'shlok':
                'यज्ञे तपसि दाने च स्थितिः सदिति चोच्यते ।\nकर्म चैव तदर्थीयं सदित्येवाभिधीयते ॥१७-२७॥',
            'meaning':
                'यज्ञ, तप और दान में दृढ़ स्थिति भी सत् कही जाती है, और उस (परमात्मा) के लिए किया गया कर्म भी सत् ही कहलाता है ।',
          },
          {
            'no': 28,
            'shlok':
                'अश्रद्धया हुतं दत्तं तपस्तप्तं कृतं च यत् ।\nअसदित्युच्यते पार्थ न च तत्प्रेत्य नो इह ॥१७-२८॥',
            'meaning':
                'हे पार्थ! श्रद्धा के बिना यज्ञ,दान या तप के रूप में जो भी किया जाता है, वह नश्र्वर है । वह असत् कहलाता है और इस जन्म तथा अगले जन्म – दोनों में ही व्यर्थ जाता है ।',
          },
        ],
      },
      //chapter 18
      {
        'id': 'अठारहवाँ अध्याय',
        'name': 'मोक्षसंन्यासयोग',
        'shloks': [
          {
            'no': 1,
            'shlok':
                'संन्यासस्य महाबाहो तत्त्वमिच्छामि वेदितुम् ।\nत्यागस्य च हृषीकेश पृथक्केशिनिषूदन ॥१८-१॥',
            'meaning':
                'अर्जुन ने कहा – हे महाबाहु! मैं त्याग का उद्देश्य जानने का इच्छुक हूँ और हे केशिनिषूदन, हे हृषिकेश! मैं त्यागमय जीवन (संन्यास आश्रम) का भी उद्देश्य जानना चाहता हूँ ।',
          },
          {
            'no': 2,
            'shlok':
                'काम्यानां कर्मणां न्यासं संन्यासं कवयो विदुः ।\nसर्वकर्मफलत्यागं प्राहुस्त्यागं विचक्षणाः ॥१८-२॥',
            'meaning':
                'भगवान् ने कहा-भौतिक इच्छा पर आधारित कर्मों के परित्याग को विद्वान लोग संन्यास कहते हैं और समस्त कर्मों के फल-त्याग को बुद्धिमान लोग त्याग कहते हैं ।',
          },
          {
            'no': 3,
            'shlok':
                'त्याज्यं दोषवदित्येके कर्म प्राहुर्मनीषिणः ।\nयज्ञदानतपःकर्म न त्याज्यमिति चापरे ॥१८-३॥',
            'meaning':
                'कुछ विद्वान घोषित करते हैं कि समस्त प्रकार के सकाम कर्मों को दोषपूर्ण समझ कर त्याग देना चाहिए । किन्तु अन्य विद्वान् मानते हैं कि यज्ञ, दान तथा तपस्या के कर्मों को कभी नहीं त्यागना चाहिए ।',
          },
          {
            'no': 4,
            'shlok':
                'निश्चयं शृणु मे तत्र त्यागे भरतसत्तम ।\nत्यागो हि पुरुषव्याघ्र त्रिविधः संप्रकीर्तितः ॥१८-४॥',
            'meaning':
                'हे भरतश्रेष्ठ! अब त्याग के विषय में मेरा निर्णय सुनो । हे नरशार्दूल! शास्त्रों में त्याग तीन तरह का बताया गया है ।',
          },
          {
            'no': 5,
            'shlok':
                'यज्ञदानतपःकर्म न त्याज्यं कार्यमेव तत् ।\nयज्ञो दानं तपश्चैव पावनानि मनीषिणाम् ॥१८-५॥',
            'meaning':
                'यज्ञ, दान तथा तपस्या के कर्मों का कभी परित्याग नहीं करना चाहिए, उन्हें अवश्य सम्पन्न करना चाहिए । निस्सन्देह यज्ञ, दान तथा तपस्या महात्माओं को भी शुद्ध बनाते हैं ।',
          },
          {
            'no': 6,
            'shlok':
                'एतान्यपि तु कर्माणि सङ्गं त्यक्त्वा फलानि च ।\nकर्तव्यानीति मे पार्थ निश्चितं मतमुत्तमम् ॥१८-६॥',
            'meaning':
                'इन सारे कार्यों को किसी प्रकार की आसक्ति या फल की आशा के बिना सम्पन्न करना चाहिए । हे पृथापुत्र! इन्हें कर्तव्य मानकर सम्पन्न किया जाना चाहिए । यही मेरा अन्तिम मत है ।',
          },
          {
            'no': 7,
            'shlok':
                'नियतस्य तु संन्यासः कर्मणो नोपपद्यते ।\nमोहात्तस्य परित्यागस्तामसः परिकीर्तितः ॥१८-७॥',
            'meaning':
                'निर्दिष्ट कर्तव्यों को कभी नहीं त्यागना चाहिए । यदि कोई मोहवश अपने नियत कर्मों का परित्याग कर देता है, तो ऐसे त्याग को तामसी कहा जाता है ।',
          },
          {
            'no': 8,
            'shlok':
                'दुःखमित्येव यत्कर्म कायक्लेशभयात्त्यजेत् ।\nस कृत्वा राजसं त्यागं नैव त्यागफलं लभेत् ॥१८-८॥',
            'meaning':
                'जो व्यक्ति नियत कर्मों को कष्टप्रद समझ कर या शारीरिक क्लेश के भय से त्याग देता है, उसके लिए कहा जाता है कि उसने यह त्याग रजो गुण में किया है । ऐसा करने से कभी त्याग का उच्च फल प्राप्त नहीं होता ।',
          },
          {
            'no': 9,
            'shlok':
                'कार्यमित्येव यत्कर्म नियतं क्रियतेऽर्जुन ।\nसङ्गं त्यक्त्वा फलं चैव स त्यागः सात्त्विको मतः ॥१८-९॥',
            'meaning':
                'हे अर्जुन! जब मनुष्य नियत कर्तव्य को करणीय मान कर करता है और समस्त भौतिक संगति तथा फल की आसक्ति को त्याग देता है, तो उसका त्याग सात्त्विक कहलाता है ।',
          },
          {
            'no': 10,
            'shlok':
                'न द्वेष्ट्यकुशलं कर्म कुशले नानुषज्जते ।\nत्यागी सत्त्वसमाविष्टो मेधावी छिन्नसंशयः ॥१८-१०॥',
            'meaning':
                'सतोगुण में स्थित बुद्धिमान त्यागी, जो न तो अशुभ कार्य से घृणा करता है, न शुभकर्म से लिप्त होता है, वह कर्म के विषय में कोई संशय नहीं रखता ।',
          },
          {
            'no': 11,
            'shlok':
                'न हि देहभृता शक्यं त्यक्तुं कर्माण्यशेषतः ।\nयस्तु कर्मफलत्यागी स त्यागीत्यभिधीयते ॥१८-११॥',
            'meaning':
                'निस्सन्देह किसी भी देहधारी प्राणी के लिए समस्त कर्मों का परित्याग कर पाना असम्भव है । लेकिन जो कर्म फल का परित्याग करता है, वह वास्तव में त्यागी है ।',
          },
          {
            'no': 12,
            'shlok':
                'अनिष्टमिष्टं मिश्रं च त्रिविधं कर्मणः फलम् ।\nभवत्यत्यागिनां प्रेत्य न तु संन्यासिनां क्वचित् ॥१८-१२॥',
            'meaning':
                'जो त्यागी नहीं है, उसके लिए इच्छित(इष्ट), अनिच्छित (अनिष्ट) तथा मिश्रित – ये तीन प्रकार के कर्मफल मृत्यु के बाद मिलते हैं । लेकिन जो संन्यासी है, उन्हें ऐसे फल का सुख-दुख नहीं भोगना पड़ता ।',
          },
          {
            'no': 13,
            'shlok':
                'पञ्चैतानि महाबाहो कारणानि निबोध मे ।\nसांख्ये कृतान्ते प्रोक्तानि सिद्धये सर्वकर्मणाम् ॥१८-१३॥',
            'meaning':
                'हे महाबाहु अर्जुन! वेदान्त के अनुसार समस्त कर्मों की पूर्ति के लिए पाँच कारण हैं । अब तुम इन्हें मुझसे सुनो ।',
          },
          {
            'no': 14,
            'shlok':
                'अधिष्ठानं तथा कर्ता करणं च पृथग्विधम् ।\nविविधाश्च पृथक्चेष्टा दैवं चैवात्र पञ्चमम् ॥१८-१४॥',
            'meaning':
                'कर्म का स्थान (शरीर), कर्ता, विभिन्न इन्द्रियाँ, अनेक प्रकार की चेष्टाएँ तथा परमात्मा – ये पाँच कर्म के कारण हैं ।',
          },
          {
            'no': 15,
            'shlok':
                'शरीरवाङ्‌मनोभिर्यत्कर्म प्रारभते नरः ।\nन्याय्यं वा विपरीतं वा पञ्चैते तस्य हेतवः ॥१८-१५॥',
            'meaning':
                'मनुष्य अपने शरीर, मन या वाणी से जो भी उचित या अनुचित कर्म करता है, वह इन पाँच कारणों के फल स्वरूप होता है ।',
          },
          {
            'no': 16,
            'shlok':
                'तत्रैवं सति कर्तारमात्मानं केवलं तु यः ।\nपश्यत्यकृतबुद्धित्वान्न स पश्यति दुर्मतिः ॥१८-१६॥',
            'meaning':
                'अतएव जो इन पाँच कारणों को न मानकर अपने आपको ही एकमात्र कर्ता मानता है, वह निश्चय ही बहुत बुद्धिमान नहीं होता और वस्तुओं को सही रूप में नहीं देखता ।',
          },
          {
            'no': 17,
            'shlok':
                'यस्य नाहंकृतो भावो बुद्धिर्यस्य न लिप्यते ।\nहत्वापि स इमाँल्लोकान्न हन्ति न निबध्यते ॥१८-१७॥',
            'meaning':
                'जो मिथ्या अहंकार से प्रेरित नहीं है, जिसकी बुद्धि बँधी नहीं है, वह इस संसार में मनुष्यों को मारता हुआ भी नहीं मारता । न ही वह अपने कर्मों से बँधा होता है ।',
          },
          {
            'no': 18,
            'shlok':
                'ज्ञानं ज्ञेयं परिज्ञाता त्रिविधा कर्मचोदना ।\nकरणं कर्म कर्तेति त्रिविधः कर्मसंग्रहः ॥१८-१८॥',
            'meaning':
                'ज्ञान, ज्ञेय तथा ज्ञाता – ये तीनों कर्म को प्रेरणा देने वाले कारण हैं । इन्द्रियाँ (करण), कर्म तथा कर्ता – ये तीन कर्म के संघटक हैं ।',
          },
          {
            'no': 19,
            'shlok':
                'ज्ञानं कर्म च कर्ता च त्रिधैव गुणभेदतः ।\nप्रोच्यते गुणसंख्याने यथावच्छृणु तान्यपि ॥१८-१९॥',
            'meaning':
                'प्रकृति के तीन गुणों के अनुसार ही ज्ञान, कर्म तथा कर्ता के तीन-तीन भेद हैं । अब तुम मुझसे इन्हें सुनो ।',
          },
          {
            'no': 20,
            'shlok':
                'सर्वभूतेषु येनैकं भावमव्ययमीक्षते ।\nअविभक्तं विभक्तेषु तज्ज्ञानं विद्धि सात्त्विकम् ॥१८-२०॥',
            'meaning':
                'जिस ज्ञान से अनन्त रूपों में विभक्त सारे जीवों में एक ही अविभक्त आध्यात्मिक प्रकृति देखी जाती है, उसे ही तुम सात्त्विक जानो ।',
          },
          {
            'no': 21,
            'shlok':
                'पृथक्त्वेन तु यज्ज्ञानं नानाभावान्पृथग्विधान् ।\nवेत्ति सर्वेषु भूतेषु तज्ज्ञानं विद्धि राजसम् ॥१८-२१॥',
            'meaning':
                'जिस ज्ञान से कोई मनुष्य विभिन्न शरीरों में भिन्न-भिन्न प्रकार का जीव देखता है, उसे तुम राजसी जानो ।',
          },
          {
            'no': 22,
            'shlok':
                'यत्तु कृत्स्नवदेकस्मिन्कार्ये सक्तमहैतुकम् ।\nअतत्त्वार्थवदल्पं च तत्तामसमुदाहृतम् ॥१८-२२॥',
            'meaning':
                'और वह ज्ञान, जिससे मनुष्य किसी एक प्रकार के कार्य को, जो अति तुच्छ है, सब कुछ मान कर, सत्य को जाने बिना उसमें लिप्त रहता है, तामसी कहा जाता है।',
          },
          {
            'no': 23,
            'shlok':
                'नियतं सङ्गरहितमरागद्वेषतः कृतम् ।\nअफलप्रेप्सुना कर्म यत्तत्सात्त्विकमुच्यते ॥१८-२३॥',
            'meaning':
                'जो कर्म नियमित है और जो आसक्ति, राग या द्वेष से रहित कर्मफल की चाह के बिना किया जाता है, वह सात्त्विक कहलाता है ।',
          },
          {
            'no': 24,
            'shlok':
                'यत्तु कामेप्सुना कर्म साहंकारेण वा पुनः ।\nक्रियते बहुलायासं तद्राजसमुदाहृतम् ॥१८-२४॥',
            'meaning':
                'लेकिन जो कार्य अपनी इच्छा पूर्ति के निमित्त प्रयासपूर्वक एवं मिथ्याअहंकार के भाव से किया जाता है, वह रजोगुणी कहा जाता है ।',
          },
          {
            'no': 25,
            'shlok':
                'अनुबन्धं क्षयं हिंसामनवेक्ष्य च पौरुषम् ।\nमोहादारभ्यते कर्म यत्तत्तामसमुच्यते ॥१८-२५॥',
            'meaning':
                'जो कर्म मोहवश शास्त्रीय आदेशों की अवहेलना करके तथा भावी बन्धन की परवाह किये बिना या हिंसा अथवा अन्यों को दुख पहुँचाने के लिए किया जाता है, वहतामसी कहलाता है ।',
          },
          {
            'no': 26,
            'shlok':
                'मुक्तसङ्गोऽनहंवादी धृत्युत्साहसमन्वितः ।\nसिद्ध्यसिद्ध्योर्निर्विकारः कर्ता सात्त्विक उच्यते ॥१८-२६॥',
            'meaning':
                'जो व्यक्ति भौतिक गुणों के संसर्ग के बिना अहंकाररहित, संकल्प तथा उत्साहपूर्वक अपना कर्म करता है और सफलता अथवा असफलता में अविचलित रहता है, वह सात्त्विक कर्ता कहलाता है ।',
          },
          {
            'no': 27,
            'shlok':
                'रागी कर्मफलप्रेप्सुर्लुब्धो हिंसात्मकोऽशुचिः ।\nहर्षशोकान्वितः कर्ता राजसः परिकीर्तितः ॥१८-२७॥',
            'meaning':
                'जो कर्ता कर्म तथा कर्म-फल के प्रति आसक्त होकर फलों का भोग करनाचाहता है तथा जो लोभी, सदैव ईर्ष्यालु, अपवित्र और सुख-दुख से विचलित होने वालाहै, वह राजसी कहा जाता है ।',
          },
          {
            'no': 28,
            'shlok':
                'अयुक्तः प्राकृतः स्तब्धः शठो नैष्कृतिकोऽलसः ।\nविषादी दीर्घसूत्री च कर्ता तामस उच्यते ॥१८-२८॥',
            'meaning':
                'जो कर्ता सदा शास्त्रों के आदेशों के विरुद्ध कार्य करता रहता है, जो भौतिकवादी, हठी, कपटी तथा अन्यों का अपमान करने में पटु है और तथा जो आलसी, सदैव खिन्न तथा काम करने में दीर्घसूत्री है, वह तमोगुणी कहलाता है ।',
          },
          {
            'no': 29,
            'shlok':
                'बुद्धेर्भेदं धृतेश्चैव गुणतस्त्रिविधं शृणु ।\nप्रोच्यमानमशेषेण पृथक्त्वेन धनंजय ॥१८-२९॥',
            'meaning':
                'हे धनञ्जय! अब मैं प्रकृति के तीनों गुणों के अनुसार तुम्हें विभिन्न प्रकार की बुद्धि तथा धृति के विषय में विस्तार से बताऊँगा । तुम इसे सुनो ।',
          },
          {
            'no': 30,
            'shlok':
                'प्रवृत्तिं च निवृत्तिं च कार्याकार्ये भयाभये ।\nबन्धं मोक्षं च या वेत्ति बुद्धिः सा पार्थ सात्त्विकी ॥१८-३०॥',
            'meaning':
                'हे पृथापुत्र! वह बुद्धि सतोगुणी है, जिसके द्वारा मनुष्य यह जानता है कि क्या करणीय है और क्या नहीं है, किस्से डरना चाहिए और किस्से नहीं, क्या बाँधने वाला है और क्या मुक्ति देने वाला है ।',
          },
          {
            'no': 31,
            'shlok':
                'यया धर्ममधर्मं च कार्यं चाकार्यमेव च ।\nअयथावत्प्रजानाति बुद्धिः सा पार्थ राजसी ॥१८-३१॥',
            'meaning':
                'हे पृथापुत्र! जो बुद्धि धर्म तथा अधर्म,करणीय तथा अकरणीय कर्म में भेद नहीं कर पाती,वह राजसी है ।',
          },
          {
            'no': 32,
            'shlok':
                'अधर्मं धर्ममिति या मन्यते तमसावृता ।\nसर्वार्थान्विपरीतांश्च बुद्धिः सा पार्थ तामसी ॥१८-३२॥',
            'meaning':
                'जो बुद्धि मोह तथा अंधकार के वशीभूत होकर अधर्म को धर्म तथा धर्म को अधर्म मानती है और सदैव विपरीत दिशा में प्रयत्न करती है, वह तामसी है ।',
          },
          {
            'no': 33,
            'shlok':
                'धृत्या यया धारयते मनःप्राणेन्द्रियक्रियाः ।\nयोगेनाव्यभिचारिण्या धृतिः सा पार्थ सात्त्विकी ॥१८-३३॥',
            'meaning':
                'हे पृथापुत्र! जो अटूट है, जिसे योगाभ्यास द्वारा अचल रहकर धारण किया जाता है और जो इस प्रकार मन, प्राण तथा इन्द्रियों के कार्यकलापों को वश में रखती है, वह धृति सात्त्विक है ।',
          },
          {
            'no': 34,
            'shlok':
                'यया तु धर्मकामार्थान्धृत्या धारयतेऽर्जुन ।\nप्रसङ्गेन फलाकाङ्क्षी धृतिः सा पार्थ राजसी ॥१८-३४॥',
            'meaning':
                'लेकिन हे अर्जुन! जिस धृति से मनुष्य धर्म, अर्थ तथा काम के फलों मेंलिप्त बना रहता है, वह राजसी है ।',
          },
          {
            'no': 35,
            'shlok':
                'यया स्वप्नं भयं शोकं विषादं मदमेव च ।\nन विमुञ्चति दुर्मेधा धृतिः सा पार्थ तामसी ॥१८-३५॥',
            'meaning':
                'हे पार्थ! जो धृति स्वप्न, भय, शोक, विषाद तथा मोह के परे नहीं जाती,ऐसी दुर्बुद्धिपूर्ण धृति तामसी है ।',
          },
          {
            'no': 36,
            'shlok':
                'सुखं त्विदानीं त्रिविधं शृणु मे भरतर्षभ ।\nअभ्यासाद्रमते यत्र दुःखान्तं च निगच्छति ॥१८-३६॥',
            'meaning':
                'हे भरतश्रेष्ठ! अब मुझसे तीन प्रकार के सुखों के विषय में सुनों,जिनके द्वारा बद्धजीव भोग करता है और जिसके द्वारा कभी-कभी दुखों का अन्त हो जाता है ।',
          },
          {
            'no': 37,
            'shlok':
                'यत्तदग्रे विषमिव परिणामेऽमृतोपमम् ।\nतत्सुखं सात्त्विकं प्रोक्तमात्मबुद्धिप्रसादजम् ॥१८-३७॥',
            'meaning':
                'जो प्रारम्भ में विष जैसा लगता है, लेकिन अन्त में अमृत के समान है औरजो मनुष्य में आत्म-साक्षात्कार जगाता है, वह सात्त्विक सुख कहलाता है ।',
          },
          {
            'no': 38,
            'shlok':
                'विषयेन्द्रियसंयोगाद्यत्तदग्रेऽमृतोपमम् ।\nपरिणामे विषमिव तत्सुखं राजसं स्मृतम् ॥१८-३८॥',
            'meaning':
                'जो सुख इन्द्रियों द्वारा उनके विषयों के संसर्ग से प्राप्त होता हैऔर प्रारम्भ में अमृततुल्य तथा अन्त में विषतुल्य लगता है, वह रजोगुणी कहलाता है ।',
          },
          {
            'no': 39,
            'shlok':
                'यदग्रे चानुबन्धे च सुखं मोहनमात्मनः ।\nनिद्रालस्यप्रमादोत्थं तत्तामसमुदाहृतम् ॥१८-३९॥',
            'meaning':
                'तथा जो सुख आत्म-साक्षात्कार के प्रति अन्धा है, जो प्रारम्भ से लेकर अन्त तक मोहकारक है और जो निद्रा, आलस्य तथा मोह से उत्पन्न होता है, वह तामसी कहलाता है ।',
          },
          {
            'no': 40,
            'shlok':
                'न तदस्ति पृथिव्यां वा दिवि देवेषु वा पुनः ।\nसत्त्वं प्रकृतिजैर्मुक्तं यदेभिः स्यात्त्रिभिर्गुणैः ॥१८-४०॥',
            'meaning':
                'इस लोक में, स्वर्ग लोकों में या देवताओं के मध्य में कोई भी ऐसाव्यक्ति विद्यमान नहीं है, जो प्रकृति के तीन गुणों से मुक्त हो ।',
          },
          {
            'no': 41,
            'shlok':
                'ब्राह्मणक्षत्रियविशां शूद्राणां च परन्तप ।\nकर्माणि प्रविभक्तानि स्वभावप्रभवैर्गुणैः ॥१८-४१॥',
            'meaning':
                'हे परन्तप! ब्राह्मणों, क्षत्रियों, वैश्यों तथा शूद्रों में प्रकृतिके गुणों के अनुसार उनके स्वभाव द्वारा उत्पन्न गुणों के द्वारा भेद किया जाता है ।',
          },
          {
            'no': 42,
            'shlok':
                'शमो दमस्तपः शौचं क्षान्तिरार्जवमेव च ।\nज्ञानं विज्ञानमास्तिक्यं ब्रह्मकर्म स्वभावजम् ॥१८-४२॥',
            'meaning':
                'शान्तिप्रियता, आत्मसंयम, तपस्या, पवित्रता, सहिष्णुता, सत्यनिष्ठा, ज्ञान,विज्ञान तथा धार्मिकता – ये सारे स्वाभाविक गुण हैं, जिनके द्वारा ब्राह्मण कर्मकरते हैं ।',
          },
          {
            'no': 43,
            'shlok':
                'शौर्यं तेजो धृतिर्दाक्ष्यं युद्धे चाप्यपलायनम् ।\nदानमीश्वरभावश्च क्षात्रं कर्म स्वभावजम् ॥१८-४३॥',
            'meaning':
                'वीरता, शक्ति, संकल्प, दक्षता, युद्ध में धैर्य, उदारता तथा नेतृत्व –ये क्षत्रियों के स्वाभाविक गुण हैं ।',
          },
          {
            'no': 44,
            'shlok':
                'कृषिगौरक्ष्यवाणिज्यं वैश्यकर्म स्वभावजम् ।\nपरिचर्यात्मकं कर्म शूद्रस्यापि स्वभावजम् ॥१८-४४॥',
            'meaning':
                'कृषि करना, गो रक्षा तथा व्यापार वैश्यों के स्वाभाविक कर्म हैं औरशूद्रों का कर्म श्रम तथा अन्यों की सेवा करना है ।',
          },
          {
            'no': 45,
            'shlok':
                'स्वे स्वे कर्मण्यभिरतः संसिद्धिं लभते नरः ।\nस्वकर्मनिरतः सिद्धिं यथा विन्दति तच्छृणु ॥१८-४५॥',
            'meaning':
                'अपने अपने कर्म के गुणों का पालन करते हुए प्रत्येक व्यक्ति सिद्ध होसकता है । अब तुम मुझसे सुनो कि यह किस प्रकार किया जा सकता है ।',
          },
          {
            'no': 46,
            'shlok':
                'यतः प्रवृत्तिर्भूतानां येन सर्वमिदं ततम् ।\nस्वकर्मणा तमभ्यर्च्य सिद्धिं विन्दति मानवः ॥१८-४६॥',
            'meaning':
                'जो सभी प्राणियों का उदगम् है और सर्वव्यापी है, उस भगवान् की उपासना करके मनुष्य अपना कर्म करते हुए पूर्णता प्राप्त कर सकता है ।',
          },
          {
            'no': 47,
            'shlok':
                'श्रेयान्स्वधर्मो विगुणः परधर्मात्स्वनुष्ठितात् ।\nस्वभावनियतं कर्म कुर्वन्नाप्नोति किल्बिषम् ॥१८-४७॥',
            'meaning':
                'अपने वृत्तिपरक कार्य को करना, चाहे वह कितना ही त्रुटिपूर्ण ढंग सेक्यों न किया जाय, अन्य किसी के कार्य को स्वीकार करने और अच्छी प्रकार करने की अपेक्षा अधिक श्रेष्ठ है । अपने स्वभाव के अनुसार निर्दिष्ट कर्म कभी भी पाप से प्रभावित नहीं होते ।',
          },
          {
            'no': 48,
            'shlok':
                'सहजं कर्म कौन्तेय सदोषमपि न त्यजेत् ।\nसर्वारम्भा हि दोषेण धूमेनाग्निरिवावृताः ॥१८-४८॥',
            'meaning':
                'प्रत्येक उद्योग (प्रयास) किसी न किसी दोष से आवृत होता है, जिस प्रकार अग्नि धुएँ से आवृत रहती है । अतएव हे कुन्तीपुत्र! मनुष्य को चाहिए कि स्वभाव से उत्पन्न कर्म को, भले ही वह दोषपूर्ण क्यों न हो, कभी त्यागे नहीं ।',
          },
          {
            'no': 49,
            'shlok':
                'असक्तबुद्धिः सर्वत्र जितात्मा विगतस्पृहः ।\nनैष्कर्म्यसिद्धिं परमां संन्यासेनाधिगच्छति ॥१८-४९॥',
            'meaning':
                'जो आत्मसंयमी तथा अनासक्त है एवं जो समस्त भौतिक भोगों की परवाह नहीं करता, वह संन्यास के अभ्यास द्वारा कर्मफल से मुक्ति की सर्वोच्च सिद्ध-अवस्था प्राप्त कर सकता है ।',
          },
          {
            'no': 50,
            'shlok':
                'सिद्धिं प्राप्तो यथा ब्रह्म तथाप्नोति निबोध मे ।\nसमासेनैव कौन्तेय निष्ठा ज्ञानस्य या परा ॥१८-५०॥',
            'meaning':
                'हे कुन्तीपुत्र! जिस तरह इस सिद्धि को प्राप्त हुआ व्यक्ति परम सिद्धावाथा अर्थात् ब्रह्म को, जो सर्वोच्च ज्ञान की अवस्था है, प्राप्त करता है, उसका मैं संक्षेप में तुमसे वर्णन करूँगा, उसे तुम जानो ।',
          },
          {
            'no': 51,
            'shlok':
                'बुद्ध्या विशुद्ध्या युक्तो धृत्यात्मानं नियम्य च ।\nशब्दादीन्विषयांस्त्यक्त्वा रागद्वेषौ व्युदस्य च ॥१८-५१॥',
            'meaning':
                'विशुद्ध बुद्धि से युक्त, धृति से आत्मसंयम कर, शब्दादि विषयों को त्याग कर और राग-द्वेष का परित्याग कर ।',
          },
          {
            'no': 52,
            'shlok':
                'विविक्तसेवी लघ्वाशी यतवाक्कायमानसः ।\nध्यानयोगपरो नित्यं वैराग्यं समुपाश्रितः ॥१८-५२॥',
            'meaning':
                'विविक्त सेवी, लघ्वाशी (मिताहारी) जिसने अपने शरीर, वाणी और मन को संयत किया है, ध्यानयोग के अभ्यास में सदैव तत्पर तथा वैराग्य पर समाश्रित ।',
          },
          {
            'no': 53,
            'shlok':
                'अहंकारं बलं दर्पं कामं क्रोधं परिग्रहम् ।\nविमुच्य निर्ममः शान्तो ब्रह्मभूयाय कल्पते ॥१८-५३॥',
            'meaning':
                'अहंकार, बल, दर्प, काम, क्रोध और परिग्रह को त्याग कर ममत्वभाव से रहित और शान्त पुरुष ब्रह्म प्राप्ति के योग्य बन जाता है ।',
          },
          {
            'no': 54,
            'shlok':
                'ब्रह्मभूतः प्रसन्नात्मा न शोचति न काङ्क्षति ।\nसमः सर्वेषु भूतेषु मद्भक्तिं लभते पराम् ॥१८-५४॥',
            'meaning':
                'इस प्रकार जो दिव्य पद पर स्थित है, वह तुरन्त परब्रह्म का अनुभव करता है और पूर्णतया प्रसन्न हो जाता है । वह न तो कभी शोक करता है, न किसी वस्तु की कामना करता है । वह प्रत्येक जीव पर समभाव रखता है । उस अवस्था में वह मेरी शुद्ध भक्ति को प्राप्त करता है ।',
          },
          {
            'no': 55,
            'shlok':
                'भक्त्या मामभिजानाति यावान्यश्चास्मि तत्त्वतः ।\nततो मां तत्त्वतो ज्ञात्वा विशते तदनन्तरम् ॥१८-५५॥',
            'meaning':
                'केवल भक्ति से मुझ भगवान् को यथारूप में जाना जा सकता है । जब मनुष्य ऐसी भक्ति से मेरे पूर्ण भावनामृत में होता है, तो वह वैकुण्ठ जगत् में प्रवेश कर सकता है ।',
          },
          {
            'no': 56,
            'shlok':
                'सर्वकर्माण्यपि सदा कुर्वाणो मद्व्यपाश्रयः ।\nमत्प्रसादादवाप्नोति शाश्वतं पदमव्ययम् ॥१८-५६॥',
            'meaning':
                'मेरा शुद्ध भक्त मेरे संरक्षण में, समस्त प्रकार के कार्यों में संलग्न रह कर भी मेरी कृपा से नित्य तथा अविनाशी धाम को प्राप्त होता है ।',
          },
          {
            'no': 57,
            'shlok':
                'चेतसा सर्वकर्माणि मयि संन्यस्य मत्परः ।\nबुद्धियोगमुपाश्रित्य मच्चित्तः सततं भव ॥१८-५७॥',
            'meaning':
                'सारे कार्यों के लिए मुझ पर निर्भर रहो और मेरे संरक्षण में सदा कर्म करो । ऐसी भक्ति में मेरे प्रति पूर्णतया सचेत रहो ।',
          },
          {
            'no': 58,
            'shlok':
                'मच्चित्तः सर्वदुर्गाणि मत्प्रसादात्तरिष्यसि ।\nअथ चेत्त्वमहंकारान्न श्रोष्यसि विनङ्क्ष्यसि ॥१८-५८॥',
            'meaning':
                'यदि तुम मुझसे भावनाभावित होगे, तो मेरी कृपा से तुम बद्ध जीवन के सारे अवरोधों को लाँघ जाओगे । लेकिन यदि तुम मिथ्या अहंकारवश ऐसी चेतना में कर्म नहीं करोगे और मेरी बात नहीं सुनोगे, तो तुम विनष्ट हो जाओगे ।',
          },
          {
            'no': 59,
            'shlok':
                'यदहंकारमाश्रित्य न योत्स्य इति मन्यसे ।\nमिथ्यैष व्यवसायस्ते प्रकृतिस्त्वां नियोक्ष्यति ॥१८-५९॥',
            'meaning':
                'यदि तुम मेरे निर्देशानुसार कर्म नहीं करते और युद्ध में प्रवृत्त नहीं होते हो, तो तुम कुमार्ग पर जाओगे । तुम्हें अपने स्वभाव वश युद्ध में लगना पड़ेगा ।',
          },
          {
            'no': 60,
            'shlok':
                'स्वभावजेन कौन्तेय निबद्धः स्वेन कर्मणा ।\nकर्तुं नेच्छसि यन्मोहात्करिष्यस्यवशोऽपि तत् ॥१८-६०॥',
            'meaning':
                'इस समय तुम मोहवश मेरे निर्देशानुसार कर्म करने से मना कर रहे हो । लेकिन हे कुन्तीपुत्र! तुम अपने ही स्वभाव से उत्पन्न कर्म द्वारा बाध्य होकर वही सब करोगे ।',
          },
          {
            'no': 61,
            'shlok':
                'ईश्वरः सर्वभूतानां हृद्देशेऽर्जुन तिष्ठति ।\nभ्रामयन्सर्वभूतानि यन्त्रारूढानि मायया ॥१८-६१॥',
            'meaning':
                'हे अर्जुन! परमेश्र्वर प्रत्येक जीव के हृदय में स्थित हैं और भौतिक शक्ति से निर्मित यन्त्र में सवार की भाँति बैठे समस्त जीवों को अपनी माया से घुमा (भरमा) रहे हैं ।',
          },
          {
            'no': 62,
            'shlok':
                'तमेव शरणं गच्छ सर्वभावेन भारत ।\nतत्प्रसादात्परां शान्तिं स्थानं प्राप्स्यसि शाश्वतम् ॥१८-६२॥',
            'meaning':
                'हे भारत! सब प्रकार से उसी की शरण में जाओ । उसकी कृपा से तुम परम शान्ति को तथा परम नित्यधाम को प्राप्त करोगे ।',
          },
          {
            'no': 63,
            'shlok':
                'इति ते ज्ञानमाख्यातं गुह्याद्‌गुह्यतरं मया ।\nविमृश्यैतदशेषेण यथेच्छसि तथा कुरु ॥१८-६३॥',
            'meaning':
                'इस प्रकार मैंने तुम्हें गुह्यतर ज्ञान बतला दिया । इस पर पूरी तरह से मनन करो और तब जो चाहे सो करो ।',
          },
          {
            'no': 64,
            'shlok':
                'सर्वगुह्यतमं भूयः शृणु मे परमं वचः ।\nइष्टोऽसि मे दृढमिति ततो वक्ष्यामि ते हितम् ॥१८-६४॥',
            'meaning':
                'चूँकि तुम मेरे अत्यन्त प्रिय मित्र हो, अतएव मैं तुम्हें अपना परम आदेश, जो सर्वाधिक गुह्यज्ञान है, बता रहा हूँ । इसे अपने हित के लिए सुनो ।',
          },
          {
            'no': 65,
            'shlok':
                'मन्मना भव मद्भक्तो मद्याजी मां नमस्कुरु ।\nमामेवैष्यसि सत्यं ते प्रतिजाने प्रियोऽसि मे ॥१८-६५॥',
            'meaning':
                'सदैव मेरा चिन्तन करो, मेरे भक्त बनो, मेरी पूजा करो और मुझे नमस्कार करो । इस प्रकार तुम निश्चित रूप से मेरे पास आओगे । मैं तुम्हें वचन देता हूँ, क्योंकि तुम मेरे परम प्रियमित्र हो ।',
          },
          {
            'no': 66,
            'shlok':
                'सर्वधर्मान्परित्यज्य मामेकं शरणं व्रज ।\nअहं त्वां सर्वपापेभ्यो मोक्षयिष्यामि मा शुचः ॥१८-६६॥',
            'meaning':
                'समस्त प्रकार के धर्मों का परित्याग करो और मेरी शरण में आओ । मैं समस्त पापों से तुम्हारा उद्धार कर दूँगा । डरो मत ।',
          },
          {
            'no': 67,
            'shlok':
                'इदं ते नातपस्काय नाभक्ताय कदाचन ।\nन चाशुश्रूषवे वाच्यं न च मां योऽभ्यसूयति ॥१८-६७॥',
            'meaning':
                'यह गुह्यज्ञान उनको कभी भी न बताया जाय जो न तो संयमी हैं, न एकनिष्ठ, न भक्ति में रत हैं, न ही उसे जो मुझसे द्वेष करता हो ।',
          },
          {
            'no': 68,
            'shlok':
                'य इमं परमं गुह्यं मद्भक्तेष्वभिधास्यति ।\nभक्तिं मयि परां कृत्वा मामेवैष्यत्यसंशयः ॥१८-६८॥',
            'meaning':
                'जो व्यक्ति भक्तों को यह परम रहस्य बताता है, वह शुद्ध भक्ति को प्राप्त करेगा और अन्त में वह मेरे पास वापस आएगा ।',
          },
          {
            'no': 69,
            'shlok':
                'न च तस्मान्मनुष्येषु कश्चिन्मे प्रियकृत्तमः ।\nभविता न च मे तस्मादन्यः प्रियतरो भुवि ॥१८-६९॥',
            'meaning':
                'इस संसार में उसकी अपेक्षा कोई अन्य सेवक न तो मुझे अधिक प्रिय है और न कभी होगा ।',
          },
          {
            'no': 70,
            'shlok':
                'अध्येष्यते च य इमं धर्म्यं संवादमावयोः ।\nज्ञानयज्ञेन तेनाहमिष्टः स्यामिति मे मतिः ॥१८-७०॥',
            'meaning':
                'और मैं घोषित करता हूँ कि जो हमारे इस पवित्र संवाद का अध्ययन करता है, वह अपनी बुद्धि से मेरी पूजा करता है ।',
          },
          {
            'no': 71,
            'shlok':
                'श्रद्धावाननसूयश्च शृणुयादपि यो नरः ।\nसोऽपि मुक्तः शुभाँल्लोकान्प्राप्नुयात्पुण्यकर्मणाम् ॥१८-७१॥',
            'meaning':
                'और जो श्रद्धा समेत और द्वेषरहित होकर इसे सुनता है, वह सारे पापों से मुक्त हो जाता है और उन शुभ लोकों को प्राप्त होता है, जहाँ पुण्यात्माएँ निवास करती हैं ।',
          },
          {
            'no': 72,
            'shlok':
                'कच्चिदेतच्छ्रुतं पार्थ त्वयैकाग्रेण चेतसा ।\nकच्चिदज्ञानसंमोहः प्रनष्टस्ते धनंजय ॥१८-७२॥',
            'meaning':
                'हे पृथापुत्र! हे धनञ्जय! क्या तुमने इसे (इस शास्त्र को) एकाग्र चित्त होकर सुना? और क्या अब तुम्हारा अज्ञान तथा मोह दूर हो गया है ?',
          },
          {
            'no': 73,
            'shlok':
                'नष्टो मोहः स्मृतिर्लब्धा त्वत्प्रसादान्मयाच्युत ।\nस्थितोऽस्मि गतसन्देहः करिष्ये वचनं तव ॥१८-७३॥',
            'meaning':
                'अर्जुन ने कहा – हे कृष्ण, हे अच्युत! अब मेरा मोह दूर हो गया । आपके अनुग्रह से मुझे मेरी स्मरण शक्ति वापस मिल गई । अब मैं संशयरहित तथा दृढ़ हूँ और आपके आदेशानुसार कर्म करने के लिए उद्यत हूँ ।',
          },
          {
            'no': 74,
            'shlok':
                'इत्यहं वासुदेवस्य पार्थस्य च महात्मनः ।\nसंवादमिममश्रौषमद्भुतं रोमहर्षणम् ॥१८-७४॥',
            'meaning':
                'संजय ने कहा – इस प्रकार मैंने कृष्ण तथा अर्जुन इन दोनों महापुरुषों की वार्ता सुनी । और यह सन्देश इतना अद्भुत है कि मेरे शरीर में रोमाञ्च हो रहा है ।',
          },
          {
            'no': 75,
            'shlok':
                'व्यासप्रसादाच्छ्रुतवानेतद्गुह्यमहं परम् ।\nयोगं योगेश्वरात्कृष्णात्साक्षात्कथयतः स्वयम् ॥१८-७५॥',
            'meaning':
                'व्यास की कृपा से मैंने ये परम गुह्य बातें साक्षात् योगेश्वर कृष्ण के मुख से अर्जुन के प्रति कही जाती हुई सुनीं ।',
          },
          {
            'no': 76,
            'shlok':
                'राजन्संस्मृत्य संस्मृत्य संवादमिममद्भुतम् ।\nकेशवार्जुनयोः पुण्यं हृष्यामि च मुहुर्मुहुः ॥१८-७६॥',
            'meaning':
                'हे राजन्! जब मैं कृष्ण तथा अर्जुन के मध्य हुई इस आश्चर्यजनक तथा पवित्र वार्ता का बारम्बार स्मरण करता हूँ, तो प्रति क्षण आह्लाद से गद्गद् हो उठता हूँ ।',
          },
          {
            'no': 77,
            'shlok':
                'तच्च संस्मृत्य संस्मृत्य रूपमत्यद्भुतं हरेः ।\nविस्मयो मे महान् राजन्हृष्यामि च पुनः पुनः ॥१८-७७॥',
            'meaning':
                'हे राजन्! भगवान् कृष्ण के अद्भुत रूप का स्मरण करते ही मैं अधिकाधिक आश्चर्यचकित होता हूँ और पुनःपुनः हर्षित होता हूँ ।',
          },
          {
            'no': 78,
            'shlok':
                'यत्र योगेश्वरः कृष्णो यत्र पार्थो धनुर्धरः ।\nतत्र श्रीर्विजयो भूतिर्ध्रुवा नीतिर्मतिर्मम ॥१८-७८॥',
            'meaning':
                'जहाँ योगेश्र्वर कृष्ण है और जहाँ परम धनुर्धर अर्जुन हैं, वहीँ ऐश्र्वर्य, विजय, अलौकिक शक्ति तथा नीति भी निश्चित रूप से रहती है । ऐसा मेरा मत है ।',
          },
        ],
      },
    ],
  },
  {
    'index': 'गीता सार',
  },
  {
    'index': 'गीता महात्मय',
  },
  {
    'index': 'गीता आरती',
  }
];

int chapterIndex = 9;

void main() {
  //print(data[0]['chapters'].length); //print how many chapters and it name are there
  //print(data[0]['chapters'][chapterIndex]['shloks'].length); // print all shloks in particular chapter

  List.generate(data[0]['chapters'][chapterIndex]['shloks'].length,
      (index) => printDataofAdhyay(index));
}

//print how many chapters and it name are there
printDataOfChapters(int index) {
  print('id: ${data[0]['chapters'][index]['id']}');
  print('name: ${data[0]['chapters'][index]['name']}  \n -------------');
}

// print all shloks in particular chapter
printDataofAdhyay(int index) {
  print('shlok: ${data[0]['chapters'][chapterIndex]['shloks'][index]['no']}');
  print(
      'shlok: ${data[0]['chapters'][chapterIndex]['shloks'][index]['shlok']}');
  print(
      'meaning: ${data[0]['chapters'][chapterIndex]['shloks'][index]['meaning']} \n -------------');
}

//prints all home list
printIndexData(int index) {
  print('index: ${data[index]['index']}');
}
