List data = [
  {
    'index': 'भगवद गीता',
    'chapters': [
      //chapter 1
      {
        'id': 'पहला अध्याय',
        'name': 'अर्जुन विषाद योग',
        'shloks': [
          {
            'no': 1,
            'shlok':
                'धृतराष्ट्र उवाचः\nधर्मक्षेत्रे कुरुक्षेत्रे समवेता युयुत्सवः ।\nमामकाः पाण्डवाश्चैव किमकुर्वत संजय ॥१-१॥',
            'meaning':
                'धृतराष्ट्र बोले -\nहे संजय! धर्मभूमि कुरुक्षेत्र में युद्ध की इच्छा से एकत्र हुए मेरे तथा पाण्डु के पुत्रों ने क्या किया ? ।',
          },
          {
            'no': 2,
            'shlok':
                'संजय उवाचः\nदृष्ट्वा तु पाण्डवानीकं व्यूढं दुर्योधनस्तदा ।\nआचार्यमुपसंगम्य राजा वचनमब्रवीत् ॥१-२॥',
            'meaning':
                'संजय बोले - \nउस समय राजा दुर्योधन ने व्यूहरचनायुक्त पाण्डवों की सेना को देखा और द्रोणाचार्य के पास जाकर यह वचन कहा ।',
          },
          {
            'no': 3,
            'shlok':
                'पश्यैतां पाण्डुपुत्राणामाचार्य महतीं चमूम् । \nव्यूढां द्रुपदपुत्रेण तव शिष्येण धीमता ॥१-३॥',
            'meaning':
                'हे आचार्य! आपके बुद्धिमान्‌ शिष्य द्रुपदपुत्र धृष्टद्युम्न द्वारा व्यूहाकार खड़ी की हुई पाण्डुपुत्रों की इस बड़ी भारी सेना को देखिए ।',
          },
          {
            'no': 4,
            'shlok':
                'अत्र शूरा महेष्वासा भीमार्जुनसमा युधि ।\nयुयुधानो विराटश्च द्रुपदश्च महारथः ॥१-४॥\nधृष्टकेतुश्चेकितानः काशिराजश्च वीर्यवान् ।\nपुरुजित्कुन्तिभोजश्च शैब्यश्च नरपुङ्गवः ॥१-५॥',
            'meaning':
                'इस सेना में भीम तथा अर्जुन के समान युद्ध करने वाले अनेक वीर धनुर्धर हैं – यथा महारथी युयुधान, विराट तथा द्रुपद, इनके साथ ही धृष्टकेतु, चेकितान, काशिराज, पुरुजित्, कुन्तिभोज तथा शैब्य जैसे महान शक्तिशाली योद्धा भी हैं ।',
          },
          {
            'no': 5,
            'shlok':
                'युधामन्युश्च विक्रान्त उत्तमौजाश्च वीर्यवान् ।\nसौभद्रो द्रौपदेयाश्च सर्व एव महारथाः ॥१-६॥\n',
            'meaning':
                'पराक्रमी युधामन्यु, अत्यन्त शक्तिशाली उत्तमौजा, सुभद्रा का पुत्र तथा द्रोपदी के पुत्र – ये सभी महारथी हैं ।',
          },
          {
            'no': 6,
            'shlok':
                'अस्माकं तु विशिष्टा ये तान्निबोध द्विजोत्तम ।\nनायका मम सैन्यस्य संज्ञार्थं तान्ब्रवीमि ते ॥१-७॥\nभवान्भीष्मश्च कर्णश्च कृपश्च समितिंजयः ।\nअश्वत्थामा विकर्णश्च सौमदत्तिस्तथैव च ॥१-८॥\nअन्ये च बहवः शूरा मदर्थे त्यक्तजीविताः ।\nनानाशस्त्रप्रहरणाः सर्वे युद्धविशारदाः ॥१-९॥',
            'meaning':
                'किन्तु हे ब्राह्मणश्रेष्ठ! अपने पक्ष में भी जो प्रधान हैं, उनको आप समझ लीजिए। आपकी जानकारी के लिए मेरी सेना के जो-जो सेनापति हैं, उनको बतलाता हूँ, मेरी सेना में स्वयं आप-द्रोणाचार्य और पितामह भीष्म तथा कर्ण और संग्रामविजयी कृपाचार्य तथा वैसे ही अश्वत्थामा, विकर्ण और सोमदत्त का पुत्र भूरिश्रवा और भी मेरे लिए जीवन की आशा त्याग देने वाले बहुत-से शूरवीर अनेक प्रकार के शस्त्रास्त्रों से सुसज्जित और सब-के-सब युद्ध में चतुर हैं ।',
          },
          {
            'no': 7,
            'shlok':
                'अपर्याप्तं तदस्माकं बलं भीष्माभिरक्षितम् ।\nपर्याप्तं त्विदमेतेषां बलं भीमाभिरक्षितम् ॥१-१०॥',
            'meaning':
                'भीष्म पितामह द्वारा रक्षित हमारी वह सेना सब प्रकार से अजेय है और भीम द्वारा रक्षित इन लोगों की यह सेना जीतने में सुगम है ।',
          },
          {
            'no': 8,
            'shlok':
                'अयनेषु च सर्वेषु यथाभागमवस्थिताः ।\nभीष्ममेवाभिरक्षन्तु भवन्तः सर्व एव हि ॥१-११॥',
            'meaning':
                'इसलिए सब मोर्चों पर अपनी-अपनी जगह स्थित रहते हुए आप लोग सभी निःसंदेह भीष्म पितामह की ही सब ओर से रक्षा करें ।',
          },
          {
            'no': 9,
            'shlok':
                'तस्य संजनयन्हर्षं कुरुवृद्धः पितामहः ।\nसिंहनादं विनद्योच्चैः शङ्खं दध्मौ प्रतापवान् ॥१-१२॥\nततः शङ्खाश्च भेर्यश्च पणवानकगोमुखाः ।\nसहसैवाभ्यहन्यन्त स शब्दस्तुमुलोऽभवत् ॥१-१३॥',
            'meaning':
                'कौरवों में वृद्ध बड़े प्रतापी पितामह भीष्म ने उस दुर्योधन के हृदय में हर्ष उत्पन्न करते हुए उच्च स्वर से सिंह की दहाड़ के समान गरजकर शंख बजाया इसके पश्चात शंख और नगाड़े तथा ढोल, मृदंग और नरसिंघे आदि बाजे एक साथ ही बज उठे। उनका वह शब्द बड़ा भयंकर हुआ ।',
          },
          {
            'no': 10,
            'shlok':
                'ततः श्वेतैर्हयैर्युक्ते महति स्यन्दने स्थितौ ।\nमाधवः पाण्डवश्चैव दिव्यौ शङ्खौ प्रदध्मतुः ॥१-१४॥',
            'meaning':
                'इसके अनन्तर सफेद घोड़ों से युक्त उत्तम रथ में बैठे हुए श्रीकृष्ण महाराज और अर्जुन ने भी अलौकिक शंख बजाए ।',
          },
          {
            'no': 11,
            'shlok':
                'पाञ्चजन्यं हृषीकेशो देवदत्तं धनञ्जयः ।\nपौण्ड्रं दध्मौ महाशङ्खं भीमकर्मा वृकोदरः ॥१-१५॥',
            'meaning':
                'श्रीकृष्ण महाराज ने पाञ्चजन्य नामक, अर्जुन ने देवदत्त नामक और भयानक कर्मवाले भीमसेन ने पौण्ड्र नामक महाशंख बजाया ।',
          },
          {
            'no': 12,
            'shlok':
                'अनन्तविजयं राजा कुन्तीपुत्रो युधिष्ठिरः ।\nनकुलः सहदेवश्च सुघोषमणिपुष्पकौ ॥१-१६॥',
            'meaning':
                'कुन्तीपुत्र राजा युधिष्ठिर ने अनन्तविजय नामक और नकुल तथा सहदेव ने सुघोष और मणिपुष्पक नामक शंख बजाए ।',
          },
          {
            'no': 13,
            'shlok':
                'काश्यश्च परमेष्वासः शिखण्डी च महारथः ।\nधृष्टद्युम्नो विराटश्च सात्यकिश्चापराजितः ॥१-१७॥\nद्रुपदो द्रौपदेयाश्च सर्वशः पृथिवीपते ।\nसौभद्रश्च महाबाहुः शङ्खान्दध्मुः पृथक्पृथक् ॥१-१८॥',
            'meaning':
                'श्रेष्ठ धनुष वाले काशिराज और महारथी शिखण्डी एवं धृष्टद्युम्न तथा राजा विराट और अजेय सात्यकि, राजा द्रुपद एवं द्रौपदी के पाँचों पुत्र और बड़ी भुजावाले सुभद्रा पुत्र अभिमन्यु- इन सभी ने, हे राजन्‌! सब ओर से अलग-अलग शंख बजाए ।',
          },
          {
            'no': 14,
            'shlok':
                'स घोषो धार्तराष्ट्राणां हृदयानि व्यदारयत् ।\nनभश्च पृथिवीं चैव तुमुलो व्यनुनादयन् ॥१-१९॥',
            'meaning':
                'और उस भयानक शब्द ने आकाश और पृथ्वी को भी गुंजाते हुए धार्तराष्ट्रों के अर्थात आपके पक्षवालों के हृदय विदीर्ण कर दिए ।',
          },
          {
            'no': 15,
            'shlok':
                'स घोषो धार्तराष्ट्राणां हृदयानि व्यदारयत् ।\nनभश्च पृथिवीं चैव तुमुलो व्यनुनादयन् ॥१-१९॥',
            'meaning':
                'और उस भयानक शब्द ने आकाश और पृथ्वी को भी गुंजाते हुए धार्तराष्ट्रों के अर्थात आपके पक्षवालों के हृदय विदीर्ण कर दिए ।',
          },
          {
            'no': 16,
            'shlok':
                'अथ व्यवस्थितान्दृष्ट्वा धार्तराष्ट्रान्कपिध्वजः ।\nप्रवृत्ते शस्त्रसंपाते धनुरुद्यम्य पाण्डवः ॥१-२०॥',
            'meaning':
                'उस समय हनुमान से अंकित ध्वजा लगे रथ पर आसीन पाण्डुपुत्र अर्जुन अपना धनुष उठा कर तीर चलाने के लिए उद्यत हुआ | हे राजन्!धृतराष्ट्र के पुत्रों को व्यूह में खड़ा देखकर अर्जुन ने श्रीकृष्ण से ये वचन कहे ।',
          },
          {
            'no': 17,
            'shlok':
                'अर्जुन उवाचः\nहृषीकेशं तदा वाक्यमिदमाह महीपते ।\nसेनयोरुभयोर्मध्ये रथं स्थापय मेऽच्युत ॥१-२१॥\nयावदेतान्निरिक्षेऽहं योद्‌धुकामानवस्थितान् ।\nकैर्मया सह योद्धव्यमस्मिन् रणसमुद्यमे ॥१-२२॥\nयोत्स्यमानानवेक्षेऽहं य एतेऽत्र समागताः ।\nधार्तराष्ट्रस्य दुर्बुद्धेर्युद्धे प्रियचिकीर्षवः ॥१-२३॥',
            'meaning':
                'अर्जुन ने कहा – हे अच्युत! कृपा करके मेरा रथ दोनों सेनाओं के बीच में ले चलें जिससे मैं यहाँ युद्ध की अभिलाषा रखने वालों को और शस्त्रों कि इस महान परीक्षा में, जिनसे मुझे संघर्ष करना है, उन्हें देख सकूँ, मुझे उन लोगों को देखने दीजिये जो यहाँ पर धृतराष्ट्र के दुर्बुद्धि पुत्र (दुर्योधन) को प्रसन्न करने की इच्छा से लड़ने के लिए आये हुए हैं ।',
          },
          {
            'no': 18,
            'shlok':
                'संजय उवाचः\nएवमुक्तो हृषीकेशो गुडाकेशेन भारत ।\nसेनयोरुभयोर्मध्ये स्थापयित्वा रथोत्तमम् ॥१-२४॥\nभीष्मद्रोणप्रमुखतः सर्वेषां च महीक्षिताम् ।\nउवाच पार्थ पश्यैतान्समवेतान्कुरूनिति ॥१-२५॥',
            'meaning':
                'संजय बोले- हे धृतराष्ट्र! अर्जुन द्वारा कहे अनुसार महाराज श्रीकृष्णचंद्र ने दोनों सेनाओं के बीच में भीष्म और द्रोणाचार्य के सामने तथा सम्पूर्ण राजाओं के सामने उत्तम रथ को खड़ा कर इस प्रकार कहा कि हे पार्थ! युद्ध के लिए जुटे हुए इन कौरवों को देख ।',
          },
          {
            'no': 19,
            'shlok':
                'तत्रापश्यत्स्थितान्पार्थः पितॄनथ पितामहान् ।\nआचार्यान्मातुलान्भ्रातॄन्पुत्रान्पौत्रान्सखींस्तथा ॥१-२६॥',
            'meaning':
                'अर्जुन ने वहाँ पर दोनों पक्षों की सेनाओं के मध्य में अपने चाचा-ताउओं, पितामहों, गुरुओं, मामाओं, भाइयों, पुत्रों, पौत्रों, मित्रों, ससुरों और शुभचिन्तकों को भी देखा ।',
          },
          {
            'no': 20,
            'shlok':
                'कृपया परयाविष्टो विषीदन्निदमब्रवीत् ।\nदृष्ट्वेमं स्वजनं कृष्ण युयुत्सुं समुपस्थितम् ॥१-२७॥',
            'meaning':
                'उन उपस्थित सम्पूर्ण बंधुओं को देखकर वे कुंतीपुत्र अर्जुन अत्यन्त करुणा से युक्त होकर शोक करते हुए यह वचन बोले ।',
          },
          {
            'no': 21,
            'shlok':
                'श्वशुरान्सुहृदश्चैव सेनयोरुभयोरपि ।\nतान्समीक्ष्य स कौन्तेयः सर्वान्बन्धूनवस्थितान् ॥१-२८॥\nसीदन्ति मम गात्राणि मुखं च परिशुष्यति ।\nवेपथुश्च शरीरे मे रोमहर्षश्च जायते ॥१-२९॥\nगाण्डीवं स्रंसते हस्तात्त्वक्चैव परिदह्यते ।\nन च शक्नोम्यवस्थातुं भ्रमतीव च मे मनः ॥१-३०॥',
            'meaning':
                'अर्जुन ने कहा – हे कृष्ण! इस प्रकार युद्ध कि इच्छा रखने वाले मित्रों तथा सम्बन्धियों को अपने समक्ष उपस्थित देखकर मेरे शरीर के अंग काँप रहे हैं और मेरा मुँह सूखा जा रहा है, मेरा सारा शरीर काँप रहा है, मेरे रोंगटे खड़े हो रहे हैं, मेरा गाण्डीव धनुष मेरे हाथ से सरक रहा है और मेरी त्वचा जल रही है, मैं यहाँ अब और अधिक खड़ा रहने में असमर्थ हूँ । मैं अपने को भूल रहा हूँ और मेरा सिर चकरा रहा है । हे कृष्ण! मुझे तो केवल अमंगल के कारण दिख रहे हैं ।',
          },
          {
            'no': 22,
            'shlok':
                'निमित्तानि च पश्यामि विपरीतानि केशव ।\nन च श्रेयोऽनुपश्यामि हत्वा स्वजनमाहवे ॥१-३१॥\nन काङ्क्षे विजयं कृष्ण न च राज्यं सुखानि च ।\nकिं नो राज्येन गोविन्द किं भोगैर्जीवितेन वा ॥१-३२॥',
            'meaning':
                'हे केशव! मैं लक्षणों को भी विपरीत ही देख रहा हूँ तथा युद्ध में स्वजन-समुदाय को मारकर कल्याण भी नहीं देखता, हे कृष्ण! मैं न तो विजय चाहता हूँ और न राज्य तथा सुखों को ही। हे गोविंद! हमें ऐसे राज्य से क्या प्रयोजन है अथवा ऐसे भोगों से और जीवन से भी क्या लाभ है?',
          },
          {
            'no': 23,
            'shlok':
                'येषामर्थे काङ्क्षितं नो राज्यं भोगाः सुखानि च ।\nत इमेऽवस्थिता युद्धे प्राणांस्त्यक्त्वा धनानि च ॥१-३३॥\nआचार्याः पितरः पुत्रास्तथैव च पितामहाः ।\nमातुलाः श्वशुराः पौत्राः श्यालाः संबन्धिनस्तथा ॥१-३४॥',
            'meaning':
                'हमें जिनके लिए राज्य, भोग और सुखादि अभीष्ट हैं, वे ही ये सब धन और जीवन की आशा को त्यागकर युद्ध में खड़े हैं, गुरुजन, ताऊ-चाचे, लड़के और उसी प्रकार दादे, मामे, ससुर, पौत्र, साले तथा और भी संबंधी लोग हैं ।',
          },
          {
            'no': 24,
            'shlok':
                'एतान्न हन्तुमिच्छामि घ्नतोऽपि मधुसूदन ।\nअपि त्रैलोक्यराज्यस्य हेतोः किं नु महीकृते ॥१-३५॥',
            'meaning':
                'हे मधुसूदन! मुझे मारने पर भी अथवा तीनों लोकों के राज्य के लिए भी मैं इन सबको मारना नहीं चाहता, फिर पृथ्वी के लिए तो कहना ही क्या है?',
          },
          {
            'no': 25,
            'shlok':
                'निहत्य धार्तराष्ट्रान्नः का प्रीतिः स्याज्जनार्दन ।\nपापमेवाश्रयेदस्मान्हत्वैतानाततायिनः ॥१-३६॥\nतस्मान्नार्हा वयं हन्तुं धार्तराष्ट्रान्स्वबान्धवान् ।\nस्वजनं हि कथं हत्वा सुखिनः स्याम माधव ॥१-३७॥',
            'meaning':
                'हे जनार्दन! धृतराष्ट्र के पुत्रों को मारकर हमें क्या प्रसन्नता होगी? इन आततायियों को मारकर तो हमें पाप ही लगेगा, अतएव हे माधव! अपने ही बान्धव धृतराष्ट्र के पुत्रों को मारने के लिए हम योग्य नहीं हैं क्योंकि अपने ही कुटुम्ब को मारकर हम कैसे सुखी होंगे?',
          },
          {
            'no': 26,
            'shlok':
                'यद्यप्येते न पश्यन्ति लोभोपहतचेतसः ।\nकुलक्षयकृतं दोषं मित्रद्रोहे च पातकम् ॥१-३८॥',
            'meaning':
                'यद्यपि लोभ से भ्रष्टचित्त हुये ये लोग कुलनाशकृत दोष और मित्र द्रोह में पाप नहीं देखते हैं ।',
          },
          {
            'no': 27,
            'shlok':
                'कथं न ज्ञेयमस्माभिः पापादस्मान्निवर्तितुम् ।\nकुलक्षयकृतं दोषं प्रपश्यद्भिर्जनार्दन ॥१-३९॥\nकुलक्षये प्रणश्यन्ति कुलधर्माः सनातनाः ।\nधर्मे नष्टे कुलं कृत्स्नमधर्मोऽभिभवत्युत ॥१-४०॥',
            'meaning':
                'हेे जनार्दन ! कुलक्षय से होने वाले दोष को जानने वाले हम लोगों को इस पाप से विरत होने के लिए क्यों नहीं सोचना चाहिये, कुल के नष्ट होने से सनातन धर्म नष्ट हो जाते हैं। धर्म नष्ट होने पर सम्पूर्ण कुल को अधर्म (पाप) दबा लेता है ।',
          },
          {
            'no': 28,
            'shlok':
                'अधर्माभिभवात्कृष्ण प्रदुष्यन्ति कुलस्त्रियः ।\nस्त्रीषु दुष्टासु वार्ष्णेय जायते वर्णसंकरः ॥१-४१॥',
            'meaning':
                'हे कृष्ण ! पाप के अधिक बढ़ जाने से कुल की स्त्रियां दूषित हो जाती हैं, और हे वार्ष्णेय ! स्त्रियों के दूषित होने पर वर्णसंकर उत्पन्न होता है ।',
          },
          {
            'no': 29,
            'shlok':
                'संकरो नरकायैव कुलघ्नानां कुलस्य च ।\nपतन्ति पितरो ह्येषां लुप्तपिण्डोदकक्रियाः ॥१-४२॥\nदोषैरेतैः कुलघ्नानां वर्णसंकरकारकैः ।\nउत्साद्यन्ते जातिधर्माः कुलधर्माश्च शाश्वताः ॥१-४३॥\nउत्सन्नकुलधर्माणां मनुष्याणां जनार्दन ।\nनरकेऽनियतं वासो भवतीत्यनुशुश्रुम ॥१-४४॥\nअहो बत महत्पापं कर्तुं व्यवसिता वयम् ।\nयद्राज्यसुखलोभेन हन्तुं स्वजनमुद्यताः ॥१-४५॥',
            'meaning':
                'वर्णसंकर कुलघातियों को और कुल को नरक में ले जाने के लिए ही होता है। लुप्त हुई पिण्ड और जल की क्रिया वाले अर्थात श्राद्ध और तर्पण से वंचित इनके पितर लोग भी अधोगति को प्राप्त होते हैं, इन वर्णसंकरकारक दोषों से कुलघातियों के सनातन कुल-धर्म और जाति-धर्म नष्ट हो जाते हैं, हे जनार्दन! जिनका कुल-धर्म नष्ट हो गया है, ऐसे मनुष्यों का अनिश्चितकाल तक नरक में वास होता है, ऐसा हम सुनते आए हैं, हा! शोक! हम लोग बुद्धिमान होकर भी महान पाप करने को तैयार हो गए हैं, जो राज्य और सुख के लोभ से स्वजनों को मारने के लिए उद्यत हो गए हैं ।',
          },
          {
            'no': 30,
            'shlok':
                'यदि मामप्रतीकारमशस्त्रं शस्त्रपाणयः ।\nधार्तराष्ट्रा रणे हन्युस्तन्मे क्षेमतरं भवेत् ॥१-४६॥',
            'meaning':
                'यदि मुझ शस्त्ररहित एवं सामना न करने वाले को शस्त्र हाथ में लिए हुए धृतराष्ट्र के पुत्र रण में मार डालें तो वह मारना भी मेरे लिए अधिक कल्याणकारक होगा ।',
          },
          {
            'no': 31,
            'shlok':
                'संजय उवाचः\nएवमुक्त्वार्जुनः संख्ये रथोपस्थ उपाविशत् । \nविसृज्य सशरं चापं शोकसंविग्नमानसः ॥१-४७॥',
            'meaning':
                'संजय बोले- रणभूमि में शोक से उद्विग्न मन वाले अर्जुन इस प्रकार कहकर, बाणसहित धनुष को त्यागकर रथ के पिछले भाग में बैठ गए ।',
          },
        ],
      },
      //chapter 2
      {
        'id': '',
        'name': '',
        'shloks': [
          {
            'shlok': '',
            'meaning': '',
          },
        ],
      },
      //chapter 3
      {
        'id': '',
        'name': '',
        'shloks': [
          {
            'shlok': '',
            'meaning': '',
          },
        ],
      },
      //chapter 4
      {
        'id': '',
        'name': '',
        'shloks': [
          {
            'shlok': '',
            'meaning': '',
          },
        ],
      },
      //chapter 5
      {
        'id': '',
        'name': '',
        'shloks': [
          {
            'shlok': '',
            'meaning': '',
          },
        ],
      },
      //chapter 6
      {
        'id': '',
        'name': '',
        'shloks': [
          {
            'shlok': '',
            'meaning': '',
          },
        ],
      },
      //chapter 7
      {
        'id': '',
        'name': '',
        'shloks': [
          {
            'shlok': '',
            'meaning': '',
          },
        ],
      },
      //chapter 8
      {
        'id': '',
        'name': '',
        'shloks': [
          {
            'shlok': '',
            'meaning': '',
          },
        ],
      },
      //chapter 9
      {
        'id': '',
        'name': '',
        'shloks': [
          {
            'shlok': '',
            'meaning': '',
          },
        ],
      },
      //chapter 10
      {
        'id': '',
        'name': '',
        'shloks': [
          {
            'shlok': '',
            'meaning': '',
          },
        ],
      },
      //chapter 11
      {
        'id': '',
        'name': '',
        'shloks': [
          {
            'shlok': '',
            'meaning': '',
          },
        ],
      },
      //chapter 12
      {
        'id': '',
        'name': '',
        'shloks': [
          {
            'shlok': '',
            'meaning': '',
          },
        ],
      },
      //chapter 13
      {
        'id': '',
        'name': '',
        'shloks': [
          {
            'shlok': '',
            'meaning': '',
          },
        ],
      },
      //chapter 14
      {
        'id': '',
        'name': '',
        'shloks': [
          {
            'shlok': '',
            'meaning': '',
          },
        ],
      },
      //chapter 15
      {
        'id': '',
        'name': '',
        'shloks': [
          {
            'shlok': '',
            'meaning': '',
          },
        ],
      },
      //chapter 16
      {
        'id': '',
        'name': '',
        'shloks': [
          {
            'shlok': '',
            'meaning': '',
          },
        ],
      },
      //chapter 17
      {
        'id': '',
        'name': '',
        'shloks': [
          {
            'shlok': '',
            'meaning': '',
          },
        ],
      },
      //chapter 18
      {
        'id': '',
        'name': '',
        'shloks': [
          {
            'shlok': '',
            'meaning': '',
          },
        ],
      },
    ],
  },
  {
    'index': 'गीता सार',
  },
  {
    'index': 'गीता महात्मय',
  },
  {
    'index': 'गीता आरती',
  }
];

int chapterIndex = 0;

void main() {
  //print(data[0]['chapters'].length); //print how many chapters and it name are there
  //print(data[0]['chapters'][0]['shloks'].length); // print all shloks in particular chapter

  List.generate(data[0]['chapters'][chapterIndex]['shloks'].length,
      (index) => printDataofAdhyay(index));
}

//print how many chapters and it name are there
printDataOfChapters(int index) {
  print('id: ${data[0]['chapters'][index]['id']}  \n -------------');
}

// print all shloks in particular chapter
printDataofAdhyay(int index) {
  print('shlok: ${data[0]['chapters'][chapterIndex]['shloks'][index]['no']}');
  print(
      'shlok: ${data[0]['chapters'][chapterIndex]['shloks'][index]['shlok']}');
  print(
      'meaning: ${data[0]['chapters'][chapterIndex]['shloks'][index]['meaning']} \n -------------');
}

//prints all home list
printIndexData(int index) {
  print('index: ${data[index]['index']}');
}
